/* automatically generated by rust-bindgen 0.57.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const LKL_IORING_FEAT_FAST_POLL: u32 = 32;
pub const LKL_IORING_FEAT_POLL_32BITS: u32 = 64;
pub const LKL_IO_URING_OP_SUPPORTED: u32 = 1;
pub const LKL_AF_UNSPEC: u32 = 0;
pub const LKL_AF_UNIX: u32 = 1;
pub const LKL_AF_LOCAL: u32 = 1;
pub const LKL_AF_INET: u32 = 2;
pub const LKL_AF_AX25: u32 = 3;
pub const LKL_AF_IPX: u32 = 4;
pub const LKL_AF_APPLETALK: u32 = 5;
pub const LKL_AF_NETROM: u32 = 6;
pub const LKL_AF_BRIDGE: u32 = 7;
pub const LKL_AF_ATMPVC: u32 = 8;
pub const LKL_AF_X25: u32 = 9;
pub const LKL_AF_INET6: u32 = 10;
pub const LKL_AF_ROSE: u32 = 11;
pub const lkl_AF_DECnet: u32 = 12;
pub const LKL_AF_NETBEUI: u32 = 13;
pub const LKL_AF_SECURITY: u32 = 14;
pub const LKL_AF_KEY: u32 = 15;
pub const LKL_AF_NETLINK: u32 = 16;
pub const LKL_AF_ROUTE: u32 = 16;
pub const LKL_AF_PACKET: u32 = 17;
pub const LKL_AF_ASH: u32 = 18;
pub const LKL_AF_ECONET: u32 = 19;
pub const LKL_AF_ATMSVC: u32 = 20;
pub const LKL_AF_RDS: u32 = 21;
pub const LKL_AF_SNA: u32 = 22;
pub const LKL_AF_IRDA: u32 = 23;
pub const LKL_AF_PPPOX: u32 = 24;
pub const LKL_AF_WANPIPE: u32 = 25;
pub const LKL_AF_LLC: u32 = 26;
pub const LKL_AF_IB: u32 = 27;
pub const LKL_AF_MPLS: u32 = 28;
pub const LKL_AF_CAN: u32 = 29;
pub const LKL_AF_TIPC: u32 = 30;
pub const LKL_AF_BLUETOOTH: u32 = 31;
pub const LKL_AF_IUCV: u32 = 32;
pub const LKL_AF_RXRPC: u32 = 33;
pub const LKL_AF_ISDN: u32 = 34;
pub const LKL_AF_PHONET: u32 = 35;
pub const LKL_AF_IEEE802154: u32 = 36;
pub const LKL_AF_CAIF: u32 = 37;
pub const LKL_AF_ALG: u32 = 38;
pub const LKL_AF_NFC: u32 = 39;
pub const LKL_AF_VSOCK: u32 = 40;
pub const LKL_SOCK_STREAM: u32 = 1;
pub const LKL_SOCK_DGRAM: u32 = 2;
pub const LKL_SOCK_RAW: u32 = 3;
pub const LKL_SOCK_RDM: u32 = 4;
pub const LKL_SOCK_SEQPACKET: u32 = 5;
pub const LKL_SOCK_DCCP: u32 = 6;
pub const LKL_SOCK_PACKET: u32 = 10;
pub const LKL_MSG_TRUNC: u32 = 32;
pub const LKL_MSG_DONTWAIT: u32 = 64;
pub const _SYS_UIO_H: u32 = 1;
pub const _BITS_UIO_LIM_H: u32 = 1;
pub const __IOV_MAX: u32 = 1024;
pub const UIO_MAXIOV: u32 = 1024;
pub const LKL_DEV_BLK_TYPE_READ: u32 = 0;
pub const LKL_DEV_BLK_TYPE_WRITE: u32 = 1;
pub const LKL_DEV_BLK_TYPE_FLUSH: u32 = 4;
pub const LKL_DEV_BLK_TYPE_FLUSH_OUT: u32 = 5;
pub const LKL_DEV_BLK_STATUS_OK: u32 = 0;
pub const LKL_DEV_BLK_STATUS_IOERR: u32 = 1;
pub const LKL_DEV_BLK_STATUS_UNSUP: u32 = 2;
pub const LKL_DEV_NET_POLL_RX: u32 = 1;
pub const LKL_DEV_NET_POLL_TX: u32 = 2;
pub const LKL_DEV_NET_POLL_HUP: u32 = 4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_mutex {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_sem {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_tls_key {
    _unused: [u8; 0],
}
pub type lkl_thread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_jmp_buf {
    pub buf: [::std::os::raw::c_ulong; 128usize],
}
#[test]
fn bindgen_test_layout_lkl_jmp_buf() {
    assert_eq!(
        ::std::mem::size_of::<lkl_jmp_buf>(),
        1024usize,
        concat!("Size of: ", stringify!(lkl_jmp_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_jmp_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_jmp_buf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_jmp_buf>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_jmp_buf),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_pci_dev {
    _unused: [u8; 0],
}
#[doc = " lkl_dev_pci_ops - PCI host operations"]
#[doc = ""]
#[doc = " These operations would be a wrapper of userspace PCI drvier and"]
#[doc = " must be provided by a host library or by the application."]
#[doc = ""]
#[doc = " @add - add a new PCI device; returns a handler or NULL if fails"]
#[doc = " @remove - release resources"]
#[doc = " @init_irq - allocate resources for interrupts"]
#[doc = " @read - read the PCI Configuration Space"]
#[doc = " @write - write the PCI Configuration Space"]
#[doc = " @resource_alloc - map BARx and return the mapped address. x is resource_index"]
#[doc = ""]
#[doc = " @map_page - return the DMA address of pages; vaddr might not be page-aligned"]
#[doc = " @unmap_page - cleanup DMA region if needed"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_dev_pci_ops {
    pub add: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            kernel_ram: *mut ::std::os::raw::c_void,
            ram_size: ::std::os::raw::c_ulong,
        ) -> *mut lkl_pci_dev,
    >,
    pub remove: ::std::option::Option<unsafe extern "C" fn(dev: *mut lkl_pci_dev)>,
    pub irq_init: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            irq: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            where_: ::std::os::raw::c_int,
            size: ::std::os::raw::c_int,
            val: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            where_: ::std::os::raw::c_int,
            size: ::std::os::raw::c_int,
            val: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub resource_alloc: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            resource_size: ::std::os::raw::c_ulong,
            resource_index: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub map_page: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            vaddr: *mut ::std::os::raw::c_void,
            size: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulonglong,
    >,
    pub unmap_page: ::std::option::Option<
        unsafe extern "C" fn(
            dev: *mut lkl_pci_dev,
            dma_handle: ::std::os::raw::c_ulonglong,
            size: ::std::os::raw::c_ulong,
        ),
    >,
}
#[test]
fn bindgen_test_layout_lkl_dev_pci_ops() {
    assert_eq!(
        ::std::mem::size_of::<lkl_dev_pci_ops>(),
        64usize,
        concat!("Size of: ", stringify!(lkl_dev_pci_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_dev_pci_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_dev_pci_ops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).add as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).remove as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).irq_init as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(irq_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).read as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).write as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).resource_alloc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(resource_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).map_page as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(map_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_dev_pci_ops>())).unmap_page as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_dev_pci_ops),
            "::",
            stringify!(unmap_page)
        )
    );
}
#[doc = " lkl_host_operations - host operations used by the Linux kernel"]
#[doc = ""]
#[doc = " These operations must be provided by a host library or by the application"]
#[doc = " itself."]
#[doc = ""]
#[doc = " @virtio_devices - string containg the list of virtio devices in virtio mmio"]
#[doc = " command line format. This string is appended to the kernel command line and"]
#[doc = " is provided here for convenience to be implemented by the host library."]
#[doc = ""]
#[doc = " @print - optional operation that receives console messages"]
#[doc = ""]
#[doc = " @panic - called during a kernel panic"]
#[doc = ""]
#[doc = " @sem_alloc - allocate a host semaphore an initialize it to count"]
#[doc = " @sem_free - free a host semaphore"]
#[doc = " @sem_up - perform an up operation on the semaphore"]
#[doc = " @sem_down - perform a down operation on the semaphore"]
#[doc = ""]
#[doc = " @mutex_alloc - allocate and initialize a host mutex; the recursive parameter"]
#[doc = " determines if the mutex is recursive or not"]
#[doc = " @mutex_free - free a host mutex"]
#[doc = " @mutex_lock - acquire the mutex"]
#[doc = " @mutex_unlock - release the mutex"]
#[doc = ""]
#[doc = " @thread_create - create a new thread and run f(arg) in its context; returns a"]
#[doc = " thread handle or 0 if the thread could not be created"]
#[doc = " @thread_detach - on POSIX systems, free up resources held by"]
#[doc = " pthreads. Noop on Win32."]
#[doc = " @thread_exit - terminates the current thread"]
#[doc = " @thread_join - wait for the given thread to terminate. Returns 0"]
#[doc = " for success, -1 otherwise"]
#[doc = ""]
#[doc = " @tls_alloc - allocate a thread local storage key; returns 0 if successful; if"]
#[doc = " destructor is not NULL it will be called when a thread terminates with its"]
#[doc = " argument set to the current thread local storage value"]
#[doc = " @tls_free - frees a thread local storage key; returns 0 if succesful"]
#[doc = " @tls_set - associate data to the thread local storage key; returns 0 if"]
#[doc = " successful"]
#[doc = " @tls_get - return data associated with the thread local storage key or NULL"]
#[doc = " on error"]
#[doc = ""]
#[doc = " @mem_alloc - allocate memory"]
#[doc = " @mem_free - free memory"]
#[doc = " @page_alloc - allocate page aligned memory"]
#[doc = " @page_free - free memory allocated by page_alloc"]
#[doc = ""]
#[doc = " @timer_create - allocate a host timer that runs fn(arg) when the timer"]
#[doc = " fires."]
#[doc = " @timer_free - disarms and free the timer"]
#[doc = " @timer_set_oneshot - arm the timer to fire once, after delta ns."]
#[doc = " @timer_set_periodic - arm the timer to fire periodically, with a period of"]
#[doc = " delta ns."]
#[doc = ""]
#[doc = " @ioremap - searches for an I/O memory region identified by addr and size and"]
#[doc = " returns a pointer to the start of the address range that can be used by"]
#[doc = " iomem_access"]
#[doc = " @iomem_acess - reads or writes to and I/O memory region; addr must be in the"]
#[doc = " range returned by ioremap"]
#[doc = ""]
#[doc = " @gettid - returns the host thread id of the caller, which need not"]
#[doc = " be the same as the handle returned by thread_create"]
#[doc = ""]
#[doc = " @jmp_buf_set - runs the give function and setups a jump back point by saving"]
#[doc = " the context in the jump buffer; jmp_buf_longjmp can be called from the give"]
#[doc = " function or any callee in that function to return back to the jump back"]
#[doc = " point"]
#[doc = ""]
#[doc = " NOTE: we can't return from jmp_buf_set before calling jmp_buf_longjmp or"]
#[doc = " otherwise the saved context (stack) is not going to be valid, so we must pass"]
#[doc = " the function that will eventually call longjmp here"]
#[doc = ""]
#[doc = " @jmp_buf_longjmp - perform a jump back to the saved jump buffer"]
#[doc = ""]
#[doc = " @memcpy - copy memory"]
#[doc = " @pci_ops - pointer to PCI host operations"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_host_operations {
    pub virtio_devices: *const ::std::os::raw::c_char,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(str_: *const ::std::os::raw::c_char, len: ::std::os::raw::c_int),
    >,
    pub panic: ::std::option::Option<unsafe extern "C" fn()>,
    pub sem_alloc:
        ::std::option::Option<unsafe extern "C" fn(count: ::std::os::raw::c_int) -> *mut lkl_sem>,
    pub sem_free: ::std::option::Option<unsafe extern "C" fn(sem: *mut lkl_sem)>,
    pub sem_up: ::std::option::Option<unsafe extern "C" fn(sem: *mut lkl_sem)>,
    pub sem_down: ::std::option::Option<unsafe extern "C" fn(sem: *mut lkl_sem)>,
    pub mutex_alloc: ::std::option::Option<
        unsafe extern "C" fn(recursive: ::std::os::raw::c_int) -> *mut lkl_mutex,
    >,
    pub mutex_free: ::std::option::Option<unsafe extern "C" fn(mutex: *mut lkl_mutex)>,
    pub mutex_lock: ::std::option::Option<unsafe extern "C" fn(mutex: *mut lkl_mutex)>,
    pub mutex_unlock: ::std::option::Option<unsafe extern "C" fn(mutex: *mut lkl_mutex)>,
    pub thread_create: ::std::option::Option<
        unsafe extern "C" fn(
            f: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            arg: *mut ::std::os::raw::c_void,
        ) -> lkl_thread_t,
    >,
    pub thread_detach: ::std::option::Option<unsafe extern "C" fn()>,
    pub thread_exit: ::std::option::Option<unsafe extern "C" fn()>,
    pub thread_join:
        ::std::option::Option<unsafe extern "C" fn(tid: lkl_thread_t) -> ::std::os::raw::c_int>,
    pub thread_self: ::std::option::Option<unsafe extern "C" fn() -> lkl_thread_t>,
    pub thread_equal: ::std::option::Option<
        unsafe extern "C" fn(a: lkl_thread_t, b: lkl_thread_t) -> ::std::os::raw::c_int,
    >,
    pub tls_alloc: ::std::option::Option<
        unsafe extern "C" fn(
            destructor: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
            >,
        ) -> *mut lkl_tls_key,
    >,
    pub tls_free: ::std::option::Option<unsafe extern "C" fn(key: *mut lkl_tls_key)>,
    pub tls_set: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut lkl_tls_key,
            data: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub tls_get: ::std::option::Option<
        unsafe extern "C" fn(key: *mut lkl_tls_key) -> *mut ::std::os::raw::c_void,
    >,
    pub mem_alloc: ::std::option::Option<
        unsafe extern "C" fn(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void,
    >,
    pub mem_free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub page_alloc: ::std::option::Option<
        unsafe extern "C" fn(size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void,
    >,
    pub page_free: ::std::option::Option<
        unsafe extern "C" fn(addr: *mut ::std::os::raw::c_void, size: ::std::os::raw::c_ulong),
    >,
    pub time: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_ulonglong>,
    pub timer_alloc: ::std::option::Option<
        unsafe extern "C" fn(
            fn_: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            arg: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub timer_set_oneshot: ::std::option::Option<
        unsafe extern "C" fn(
            timer: *mut ::std::os::raw::c_void,
            delta: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub timer_free: ::std::option::Option<unsafe extern "C" fn(timer: *mut ::std::os::raw::c_void)>,
    pub ioremap: ::std::option::Option<
        unsafe extern "C" fn(
            addr: ::std::os::raw::c_long,
            size: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub iomem_access: ::std::option::Option<
        unsafe extern "C" fn(
            addr: *const ::std::os::raw::c_void,
            val: *mut ::std::os::raw::c_void,
            size: ::std::os::raw::c_int,
            write: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub gettid: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_long>,
    pub jmp_buf_set: ::std::option::Option<
        unsafe extern "C" fn(
            jmpb: *mut lkl_jmp_buf,
            f: ::std::option::Option<unsafe extern "C" fn()>,
        ),
    >,
    pub jmp_buf_longjmp: ::std::option::Option<
        unsafe extern "C" fn(jmpb: *mut lkl_jmp_buf, val: ::std::os::raw::c_int),
    >,
    pub memcpy: ::std::option::Option<
        unsafe extern "C" fn(
            dest: *mut ::std::os::raw::c_void,
            src: *const ::std::os::raw::c_void,
            count: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub pci_ops: *mut lkl_dev_pci_ops,
}
#[test]
fn bindgen_test_layout_lkl_host_operations() {
    assert_eq!(
        ::std::mem::size_of::<lkl_host_operations>(),
        288usize,
        concat!("Size of: ", stringify!(lkl_host_operations))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_host_operations>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_host_operations))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).virtio_devices as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(virtio_devices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).print as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).panic as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(panic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).sem_alloc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(sem_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).sem_free as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(sem_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).sem_up as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(sem_up)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).sem_down as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(sem_down)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).mutex_alloc as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mutex_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).mutex_free as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mutex_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).mutex_lock as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mutex_lock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).mutex_unlock as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mutex_unlock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).thread_create as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_create)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).thread_detach as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_detach)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).thread_exit as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_exit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).thread_join as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).thread_self as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_self)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).thread_equal as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(thread_equal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).tls_alloc as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(tls_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).tls_free as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(tls_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).tls_set as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(tls_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).tls_get as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(tls_get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).mem_alloc as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mem_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).mem_free as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(mem_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).page_alloc as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(page_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).page_free as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(page_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).time as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).timer_alloc as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(timer_alloc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).timer_set_oneshot as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(timer_set_oneshot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).timer_free as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(timer_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).ioremap as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(ioremap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).iomem_access as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(iomem_access)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).gettid as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(gettid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).jmp_buf_set as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(jmp_buf_set)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_host_operations>())).jmp_buf_longjmp as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(jmp_buf_longjmp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).memcpy as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(memcpy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_host_operations>())).pci_ops as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_host_operations),
            "::",
            stringify!(pci_ops)
        )
    );
}
extern "C" {
    #[doc = " lkl_start_kernel - registers the host operations and starts the kernel"]
    #[doc = ""]
    #[doc = " The function returns only after the kernel is shutdown with lkl_sys_halt."]
    #[doc = ""]
    #[doc = " @lkl_ops - pointer to host operations"]
    #[doc = " @cmd_line - format for command line string that is going to be used to"]
    #[doc = " generate the Linux kernel command line"]
    pub fn lkl_start_kernel(
        lkl_ops: *mut lkl_host_operations,
        cmd_line: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " lkl_is_running - returns 1 if the kernel is currently running"]
    pub fn lkl_is_running() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " lkl_printf - print a message via the host print operation"]
    #[doc = ""]
    #[doc = " @fmt: printf like format string"]
    pub fn lkl_printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lkl_bug(arg1: *const ::std::os::raw::c_char, ...);
}
pub type __lkl__s8 = ::std::os::raw::c_schar;
pub type __lkl__u8 = ::std::os::raw::c_uchar;
pub type __lkl__s16 = ::std::os::raw::c_short;
pub type __lkl__u16 = ::std::os::raw::c_ushort;
pub type __lkl__s32 = ::std::os::raw::c_int;
pub type __lkl__u32 = ::std::os::raw::c_uint;
pub type __lkl__s64 = ::std::os::raw::c_longlong;
pub type __lkl__u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___lkl__kernel_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__lkl__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __lkl__kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __lkl__kernel_key_t = ::std::os::raw::c_int;
pub type __lkl__kernel_mqd_t = ::std::os::raw::c_int;
pub type __lkl__kernel_long_t = ::std::os::raw::c_long;
pub type __lkl__kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __lkl__kernel_ino_t = __lkl__kernel_ulong_t;
pub type __lkl__kernel_mode_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_pid_t = ::std::os::raw::c_int;
pub type __lkl__kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __lkl__kernel_uid_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_gid_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_suseconds_t = __lkl__kernel_long_t;
pub type __lkl__kernel_daddr_t = ::std::os::raw::c_int;
pub type __lkl__kernel_uid32_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_gid32_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_old_uid_t = __lkl__kernel_uid_t;
pub type __lkl__kernel_old_gid_t = __lkl__kernel_gid_t;
pub type __lkl__kernel_old_dev_t = ::std::os::raw::c_uint;
pub type __lkl__kernel_size_t = __lkl__kernel_ulong_t;
pub type __lkl__kernel_ssize_t = __lkl__kernel_long_t;
pub type __lkl__kernel_ptrdiff_t = __lkl__kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___lkl__kernel_fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__lkl__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_fsid_t>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __lkl__kernel_off_t = __lkl__kernel_long_t;
pub type __lkl__kernel_loff_t = ::std::os::raw::c_longlong;
pub type __lkl__kernel_old_time_t = __lkl__kernel_long_t;
pub type __lkl__kernel_time_t = __lkl__kernel_long_t;
pub type __lkl__kernel_time64_t = ::std::os::raw::c_longlong;
pub type __lkl__kernel_clock_t = __lkl__kernel_long_t;
pub type __lkl__kernel_timer_t = ::std::os::raw::c_int;
pub type __lkl__kernel_clockid_t = ::std::os::raw::c_int;
pub type __lkl__kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __lkl__kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __lkl__kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __lkl__le16 = __lkl__u16;
pub type __lkl__be16 = __lkl__u16;
pub type __lkl__le32 = __lkl__u32;
pub type __lkl__be32 = __lkl__u32;
pub type __lkl__le64 = __lkl__u64;
pub type __lkl__be64 = __lkl__u64;
pub type __lkl__sum16 = __lkl__u16;
pub type __lkl__wsum = __lkl__u32;
pub type __lkl__poll_t = ::std::os::raw::c_uint;
pub type lkl_qid_t = __lkl__kernel_uid32_t;
pub type lkl_fd_set = __lkl__kernel_fd_set;
pub type lkl_mode_t = __lkl__kernel_mode_t;
pub type lkl_umode_t = ::std::os::raw::c_ushort;
pub type lkl_nlink_t = __lkl__u32;
pub type lkl_off_t = __lkl__kernel_off_t;
pub type lkl_pid_t = __lkl__kernel_pid_t;
pub type lkl_key_t = __lkl__kernel_key_t;
pub type lkl_suseconds_t = __lkl__kernel_suseconds_t;
pub type lkl_timer_t = __lkl__kernel_timer_t;
pub type lkl_clockid_t = __lkl__kernel_clockid_t;
pub type lkl_mqd_t = __lkl__kernel_mqd_t;
pub type lkl_uid_t = __lkl__kernel_uid32_t;
pub type lkl_gid_t = __lkl__kernel_gid32_t;
pub type lkl_uid16_t = __lkl__kernel_uid16_t;
pub type lkl_gid16_t = __lkl__kernel_gid16_t;
pub type lkl_uintptr_t = ::std::os::raw::c_ulong;
pub type lkl_loff_t = __lkl__kernel_loff_t;
pub type lkl_size_t = __lkl__kernel_size_t;
pub type lkl_ssize_t = __lkl__kernel_ssize_t;
pub type lkl_time_t = __lkl__kernel_time_t;
pub type lkl_clock_t = __lkl__kernel_clock_t;
pub type lkl_u32 = __lkl__u32;
pub type lkl_s32 = __lkl__s32;
pub type lkl_u64 = __lkl__u64;
pub type lkl_s64 = __lkl__s64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_timespec {
    pub tv_sec: __lkl__kernel_time64_t,
    pub tv_nsec: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___lkl__kernel_timespec() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(__lkl__kernel_timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_itimerspec {
    pub it_interval: __lkl__kernel_timespec,
    pub it_value: __lkl__kernel_timespec,
}
#[test]
fn bindgen_test_layout___lkl__kernel_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(__lkl__kernel_itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_itimerspec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_itimerspec>())).it_interval as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_itimerspec>())).it_value as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_old_timeval {
    pub tv_sec: __lkl__kernel_long_t,
    pub tv_usec: __lkl__kernel_long_t,
}
#[test]
fn bindgen_test_layout___lkl__kernel_old_timeval() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_old_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(__lkl__kernel_old_timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_old_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_old_timeval))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_timeval>())).tv_sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_timeval>())).tv_usec as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_old_timespec {
    pub tv_sec: __lkl__kernel_old_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout___lkl__kernel_old_timespec() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_old_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(__lkl__kernel_old_timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_old_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_old_timespec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_timespec>())).tv_sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_timespec>())).tv_nsec as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_old_itimerval {
    pub it_interval: __lkl__kernel_old_timeval,
    pub it_value: __lkl__kernel_old_timeval,
}
#[test]
fn bindgen_test_layout___lkl__kernel_old_itimerval() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_old_itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(__lkl__kernel_old_itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_old_itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_old_itimerval))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_itimerval>())).it_interval as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_old_itimerval>())).it_value as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_old_itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_sock_timeval {
    pub tv_sec: __lkl__s64,
    pub tv_usec: __lkl__s64,
}
#[test]
fn bindgen_test_layout___lkl__kernel_sock_timeval() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_sock_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(__lkl__kernel_sock_timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_sock_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_sock_timeval))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_sock_timeval>())).tv_sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_sock_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_sock_timeval>())).tv_usec as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_sock_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_timespec {
    pub tv_sec: __lkl__kernel_old_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_lkl_timespec() {
    assert_eq!(
        ::std::mem::size_of::<lkl_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_timeval {
    pub tv_sec: __lkl__kernel_old_time_t,
    pub tv_usec: __lkl__kernel_suseconds_t,
}
#[test]
fn bindgen_test_layout_lkl_timeval() {
    assert_eq!(
        ::std::mem::size_of::<lkl_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_itimerspec {
    pub it_interval: lkl_timespec,
    pub it_value: lkl_timespec,
}
#[test]
fn bindgen_test_layout_lkl_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<lkl_itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_itimerval {
    pub it_interval: lkl_timeval,
    pub it_value: lkl_timeval,
}
#[test]
fn bindgen_test_layout_lkl_itimerval() {
    assert_eq!(
        ::std::mem::size_of::<lkl_itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_itimerval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_itimerval>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_itimerval>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_lkl_timezone() {
    assert_eq!(
        ::std::mem::size_of::<lkl_timezone>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_timezone))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timezone>())).tz_minuteswest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timezone>())).tz_dsttime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_tms {
    pub tms_utime: __lkl__kernel_clock_t,
    pub tms_stime: __lkl__kernel_clock_t,
    pub tms_cutime: __lkl__kernel_clock_t,
    pub tms_cstime: __lkl__kernel_clock_t,
}
#[test]
fn bindgen_test_layout_lkl_tms() {
    assert_eq!(
        ::std::mem::size_of::<lkl_tms>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_tms))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_tms>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_tms))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_tms>())).tms_utime as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_tms),
            "::",
            stringify!(tms_utime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_tms>())).tms_stime as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_tms),
            "::",
            stringify!(tms_stime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_tms>())).tms_cutime as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_tms),
            "::",
            stringify!(tms_cutime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_tms>())).tms_cstime as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_tms),
            "::",
            stringify!(tms_cstime)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_timex {
    pub modes: ::std::os::raw::c_uint,
    pub offset: __lkl__kernel_long_t,
    pub freq: __lkl__kernel_long_t,
    pub maxerror: __lkl__kernel_long_t,
    pub esterror: __lkl__kernel_long_t,
    pub status: ::std::os::raw::c_int,
    pub constant: __lkl__kernel_long_t,
    pub precision: __lkl__kernel_long_t,
    pub tolerance: __lkl__kernel_long_t,
    pub time: lkl_timeval,
    pub tick: __lkl__kernel_long_t,
    pub ppsfreq: __lkl__kernel_long_t,
    pub jitter: __lkl__kernel_long_t,
    pub shift: ::std::os::raw::c_int,
    pub stabil: __lkl__kernel_long_t,
    pub jitcnt: __lkl__kernel_long_t,
    pub calcnt: __lkl__kernel_long_t,
    pub errcnt: __lkl__kernel_long_t,
    pub stbcnt: __lkl__kernel_long_t,
    pub tai: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 44usize]>,
}
#[test]
fn bindgen_test_layout_lkl_timex() {
    assert_eq!(
        ::std::mem::size_of::<lkl_timex>(),
        208usize,
        concat!("Size of: ", stringify!(lkl_timex))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_timex>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_timex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).modes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(modes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).freq as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).maxerror as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(maxerror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).esterror as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(esterror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).status as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).constant as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).precision as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).tolerance as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(tolerance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).time as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).tick as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).ppsfreq as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(ppsfreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).jitter as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(jitter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).shift as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).stabil as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(stabil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).jitcnt as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(jitcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).calcnt as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(calcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).errcnt as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(errcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).stbcnt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(stbcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_timex>())).tai as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_timex),
            "::",
            stringify!(tai)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__kernel_timex_timeval {
    pub tv_sec: __lkl__kernel_time64_t,
    pub tv_usec: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___lkl__kernel_timex_timeval() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_timex_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(__lkl__kernel_timex_timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_timex_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_timex_timeval))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_timex_timeval>())).tv_sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__kernel_timex_timeval>())).tv_usec as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __lkl__kernel_timex {
    pub modes: ::std::os::raw::c_uint,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub offset: ::std::os::raw::c_longlong,
    pub freq: ::std::os::raw::c_longlong,
    pub maxerror: ::std::os::raw::c_longlong,
    pub esterror: ::std::os::raw::c_longlong,
    pub status: ::std::os::raw::c_int,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub constant: ::std::os::raw::c_longlong,
    pub precision: ::std::os::raw::c_longlong,
    pub tolerance: ::std::os::raw::c_longlong,
    pub time: __lkl__kernel_timex_timeval,
    pub tick: ::std::os::raw::c_longlong,
    pub ppsfreq: ::std::os::raw::c_longlong,
    pub jitter: ::std::os::raw::c_longlong,
    pub shift: ::std::os::raw::c_int,
    pub _bitfield_align_3: [u8; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub stabil: ::std::os::raw::c_longlong,
    pub jitcnt: ::std::os::raw::c_longlong,
    pub calcnt: ::std::os::raw::c_longlong,
    pub errcnt: ::std::os::raw::c_longlong,
    pub stbcnt: ::std::os::raw::c_longlong,
    pub tai: ::std::os::raw::c_int,
    pub _bitfield_align_4: [u8; 0],
    pub _bitfield_4: __BindgenBitfieldUnit<[u8; 44usize]>,
}
#[test]
fn bindgen_test_layout___lkl__kernel_timex() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__kernel_timex>(),
        208usize,
        concat!("Size of: ", stringify!(__lkl__kernel_timex))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__kernel_timex>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__kernel_timex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).modes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(modes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).freq as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).maxerror as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(maxerror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).esterror as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(esterror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).status as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).constant as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).precision as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).tolerance as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(tolerance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).time as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).tick as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).ppsfreq as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(ppsfreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).jitter as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(jitter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).shift as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).stabil as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(stabil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).jitcnt as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(jitcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).calcnt as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(calcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).errcnt as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(errcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).stbcnt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(stbcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__kernel_timex>())).tai as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__kernel_timex),
            "::",
            stringify!(tai)
        )
    );
}
impl __lkl__kernel_timex {
    #[inline]
    pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn new_bitfield_2() -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn new_bitfield_3() -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__user_cap_header_struct {
    pub version: __lkl__u32,
    pub pid: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___lkl__user_cap_header_struct() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__user_cap_header_struct>(),
        8usize,
        concat!("Size of: ", stringify!(__lkl__user_cap_header_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__user_cap_header_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(__lkl__user_cap_header_struct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__user_cap_header_struct>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__user_cap_header_struct),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__user_cap_header_struct>())).pid as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__user_cap_header_struct),
            "::",
            stringify!(pid)
        )
    );
}
pub type lkl_cap_user_header_t = *mut __lkl__user_cap_header_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lkl__user_cap_data_struct {
    pub effective: __lkl__u32,
    pub permitted: __lkl__u32,
    pub inheritable: __lkl__u32,
}
#[test]
fn bindgen_test_layout___lkl__user_cap_data_struct() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__user_cap_data_struct>(),
        12usize,
        concat!("Size of: ", stringify!(__lkl__user_cap_data_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__user_cap_data_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(__lkl__user_cap_data_struct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__user_cap_data_struct>())).effective as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__user_cap_data_struct),
            "::",
            stringify!(effective)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__user_cap_data_struct>())).permitted as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__user_cap_data_struct),
            "::",
            stringify!(permitted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__user_cap_data_struct>())).inheritable as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__user_cap_data_struct),
            "::",
            stringify!(inheritable)
        )
    );
}
pub type lkl_cap_user_data_t = *mut __lkl__user_cap_data_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_vfs_cap_data {
    pub magic_etc: __lkl__le32,
    pub data: [lkl_vfs_cap_data__bindgen_ty_1; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_vfs_cap_data__bindgen_ty_1 {
    pub permitted: __lkl__le32,
    pub inheritable: __lkl__le32,
}
#[test]
fn bindgen_test_layout_lkl_vfs_cap_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_vfs_cap_data__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_vfs_cap_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_vfs_cap_data__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_vfs_cap_data__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_vfs_cap_data__bindgen_ty_1>())).permitted as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_cap_data__bindgen_ty_1),
            "::",
            stringify!(permitted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_vfs_cap_data__bindgen_ty_1>())).inheritable as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_cap_data__bindgen_ty_1),
            "::",
            stringify!(inheritable)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_vfs_cap_data() {
    assert_eq!(
        ::std::mem::size_of::<lkl_vfs_cap_data>(),
        20usize,
        concat!("Size of: ", stringify!(lkl_vfs_cap_data))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_vfs_cap_data>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_vfs_cap_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_vfs_cap_data>())).magic_etc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_cap_data),
            "::",
            stringify!(magic_etc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_vfs_cap_data>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_cap_data),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_vfs_ns_cap_data {
    pub magic_etc: __lkl__le32,
    pub data: [lkl_vfs_ns_cap_data__bindgen_ty_1; 2usize],
    pub rootid: __lkl__le32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_vfs_ns_cap_data__bindgen_ty_1 {
    pub permitted: __lkl__le32,
    pub inheritable: __lkl__le32,
}
#[test]
fn bindgen_test_layout_lkl_vfs_ns_cap_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_vfs_ns_cap_data__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_vfs_ns_cap_data__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_vfs_ns_cap_data__bindgen_ty_1>())).permitted as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1),
            "::",
            stringify!(permitted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_vfs_ns_cap_data__bindgen_ty_1>())).inheritable as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_ns_cap_data__bindgen_ty_1),
            "::",
            stringify!(inheritable)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_vfs_ns_cap_data() {
    assert_eq!(
        ::std::mem::size_of::<lkl_vfs_ns_cap_data>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_vfs_ns_cap_data))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_vfs_ns_cap_data>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_vfs_ns_cap_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_vfs_ns_cap_data>())).magic_etc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_ns_cap_data),
            "::",
            stringify!(magic_etc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_vfs_ns_cap_data>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_ns_cap_data),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_vfs_ns_cap_data>())).rootid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_vfs_ns_cap_data),
            "::",
            stringify!(rootid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_statx_timestamp {
    pub tv_sec: __lkl__s64,
    pub tv_nsec: __lkl__u32,
    pub __reserved: __lkl__s32,
}
#[test]
fn bindgen_test_layout_lkl_statx_timestamp() {
    assert_eq!(
        ::std::mem::size_of::<lkl_statx_timestamp>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_statx_timestamp))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_statx_timestamp>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_statx_timestamp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx_timestamp>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx_timestamp),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx_timestamp>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx_timestamp),
            "::",
            stringify!(tv_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx_timestamp>())).__reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx_timestamp),
            "::",
            stringify!(__reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_statx {
    pub stx_mask: __lkl__u32,
    pub stx_blksize: __lkl__u32,
    pub stx_attributes: __lkl__u64,
    pub stx_nlink: __lkl__u32,
    pub stx_uid: __lkl__u32,
    pub stx_gid: __lkl__u32,
    pub stx_mode: __lkl__u16,
    pub __spare0: [__lkl__u16; 1usize],
    pub stx_ino: __lkl__u64,
    pub stx_size: __lkl__u64,
    pub stx_blocks: __lkl__u64,
    pub stx_attributes_mask: __lkl__u64,
    pub stx_atime: lkl_statx_timestamp,
    pub stx_btime: lkl_statx_timestamp,
    pub stx_ctime: lkl_statx_timestamp,
    pub stx_mtime: lkl_statx_timestamp,
    pub stx_rdev_major: __lkl__u32,
    pub stx_rdev_minor: __lkl__u32,
    pub stx_dev_major: __lkl__u32,
    pub stx_dev_minor: __lkl__u32,
    pub stx_mnt_id: __lkl__u64,
    pub __spare2: __lkl__u64,
    pub __spare3: [__lkl__u64; 12usize],
}
#[test]
fn bindgen_test_layout_lkl_statx() {
    assert_eq!(
        ::std::mem::size_of::<lkl_statx>(),
        256usize,
        concat!("Size of: ", stringify!(lkl_statx))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_statx>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_statx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_blksize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_attributes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_attributes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_nlink as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_uid as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_gid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_mode as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).__spare0 as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(__spare0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_ino as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_blocks as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_attributes_mask as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_attributes_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_atime as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_btime as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_btime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_ctime as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_mtime as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_rdev_major as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_rdev_major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_rdev_minor as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_rdev_minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_dev_major as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_dev_major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_dev_minor as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_dev_minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).stx_mnt_id as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(stx_mnt_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).__spare2 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(__spare2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statx>())).__spare3 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statx),
            "::",
            stringify!(__spare3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_f_owner_ex {
    pub type_: ::std::os::raw::c_int,
    pub pid: __lkl__kernel_pid_t,
}
#[test]
fn bindgen_test_layout_lkl_f_owner_ex() {
    assert_eq!(
        ::std::mem::size_of::<lkl_f_owner_ex>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_f_owner_ex))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_f_owner_ex>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_f_owner_ex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_f_owner_ex>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_f_owner_ex),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_f_owner_ex>())).pid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_f_owner_ex),
            "::",
            stringify!(pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_flock {
    pub l_type: ::std::os::raw::c_short,
    pub l_whence: ::std::os::raw::c_short,
    pub l_start: __lkl__kernel_off_t,
    pub l_len: __lkl__kernel_off_t,
    pub l_pid: __lkl__kernel_pid_t,
}
#[test]
fn bindgen_test_layout_lkl_flock() {
    assert_eq!(
        ::std::mem::size_of::<lkl_flock>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_flock))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_flock>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_flock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock>())).l_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock>())).l_whence as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock>())).l_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock>())).l_len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock>())).l_pid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_flock64 {
    pub l_type: ::std::os::raw::c_short,
    pub l_whence: ::std::os::raw::c_short,
    pub l_start: __lkl__kernel_loff_t,
    pub l_len: __lkl__kernel_loff_t,
    pub l_pid: __lkl__kernel_pid_t,
}
#[test]
fn bindgen_test_layout_lkl_flock64() {
    assert_eq!(
        ::std::mem::size_of::<lkl_flock64>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_flock64))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_flock64>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_flock64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock64>())).l_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock64),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock64>())).l_whence as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock64),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock64>())).l_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock64),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock64>())).l_len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock64),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_flock64>())).l_pid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_flock64),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_open_how {
    pub flags: __lkl__u64,
    pub mode: __lkl__u64,
    pub resolve: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_open_how() {
    assert_eq!(
        ::std::mem::size_of::<lkl_open_how>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_open_how))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_open_how>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_open_how))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_open_how>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_open_how),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_open_how>())).mode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_open_how),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_open_how>())).resolve as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_open_how),
            "::",
            stringify!(resolve)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_fscrypt_policy_v1 {
    pub version: __lkl__u8,
    pub contents_encryption_mode: __lkl__u8,
    pub filenames_encryption_mode: __lkl__u8,
    pub flags: __lkl__u8,
    pub master_key_descriptor: [__lkl__u8; 8usize],
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_policy_v1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_policy_v1>(),
        12usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_policy_v1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_policy_v1>(),
        1usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_policy_v1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_policy_v1>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v1>())).contents_encryption_mode as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v1),
            "::",
            stringify!(contents_encryption_mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v1>())).filenames_encryption_mode as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v1),
            "::",
            stringify!(filenames_encryption_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_policy_v1>())).flags as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v1>())).master_key_descriptor as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v1),
            "::",
            stringify!(master_key_descriptor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_fscrypt_key {
    pub mode: __lkl__u32,
    pub raw: [__lkl__u8; 64usize],
    pub size: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_key() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_key>(),
        72usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_key))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_key>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_key>())).mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_key>())).raw as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_key>())).size as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_fscrypt_policy_v2 {
    pub version: __lkl__u8,
    pub contents_encryption_mode: __lkl__u8,
    pub filenames_encryption_mode: __lkl__u8,
    pub flags: __lkl__u8,
    pub __reserved: [__lkl__u8; 4usize],
    pub master_key_identifier: [__lkl__u8; 16usize],
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_policy_v2() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_policy_v2>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_policy_v2))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_policy_v2>(),
        1usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_policy_v2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).contents_encryption_mode as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(contents_encryption_mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).filenames_encryption_mode as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(filenames_encryption_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).flags as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).__reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_policy_v2>())).master_key_identifier as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_policy_v2),
            "::",
            stringify!(master_key_identifier)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_fscrypt_get_policy_ex_arg {
    pub policy_size: __lkl__u64,
    pub policy: lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1 {
    pub version: __lkl__u8,
    pub v1: lkl_fscrypt_policy_v1,
    pub v2: lkl_fscrypt_policy_v2,
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>())).version
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>())).v1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
            "::",
            stringify!(v1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1>())).v2 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg__bindgen_ty_1),
            "::",
            stringify!(v2)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_get_policy_ex_arg() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_get_policy_ex_arg>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_get_policy_ex_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_get_policy_ex_arg>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_get_policy_ex_arg))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_policy_ex_arg>())).policy_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg),
            "::",
            stringify!(policy_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_policy_ex_arg>())).policy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_policy_ex_arg),
            "::",
            stringify!(policy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_fscrypt_key_specifier {
    pub type_: __lkl__u32,
    pub __reserved: __lkl__u32,
    pub u: lkl_fscrypt_key_specifier__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_fscrypt_key_specifier__bindgen_ty_1 {
    pub __reserved: [__lkl__u8; 32usize],
    pub descriptor: [__lkl__u8; 8usize],
    pub identifier: [__lkl__u8; 16usize],
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_key_specifier__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_key_specifier__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_key_specifier__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_key_specifier__bindgen_ty_1>())).__reserved
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_key_specifier__bindgen_ty_1>())).descriptor
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
            "::",
            stringify!(descriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_key_specifier__bindgen_ty_1>())).identifier
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier__bindgen_ty_1),
            "::",
            stringify!(identifier)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_key_specifier() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_key_specifier>(),
        40usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_key_specifier))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_key_specifier>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_key_specifier))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_key_specifier>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_key_specifier>())).__reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_key_specifier>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_key_specifier),
            "::",
            stringify!(u)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lkl_fscrypt_provisioning_key_payload {
    pub type_: __lkl__u32,
    pub __reserved: __lkl__u32,
    pub raw: __IncompleteArrayField<__lkl__u8>,
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_provisioning_key_payload() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_provisioning_key_payload>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(lkl_fscrypt_provisioning_key_payload)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_provisioning_key_payload>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_fscrypt_provisioning_key_payload)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_provisioning_key_payload>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_provisioning_key_payload),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_provisioning_key_payload>())).__reserved as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_provisioning_key_payload),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_provisioning_key_payload>())).raw as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_provisioning_key_payload),
            "::",
            stringify!(raw)
        )
    );
}
#[repr(C)]
pub struct lkl_fscrypt_add_key_arg {
    pub key_spec: lkl_fscrypt_key_specifier,
    pub raw_size: __lkl__u32,
    pub key_id: __lkl__u32,
    pub __reserved: [__lkl__u32; 8usize],
    pub raw: __IncompleteArrayField<__lkl__u8>,
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_add_key_arg() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_add_key_arg>(),
        80usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_add_key_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_add_key_arg>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_add_key_arg))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_add_key_arg>())).key_spec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_add_key_arg),
            "::",
            stringify!(key_spec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_add_key_arg>())).raw_size as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_add_key_arg),
            "::",
            stringify!(raw_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_add_key_arg>())).key_id as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_add_key_arg),
            "::",
            stringify!(key_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_add_key_arg>())).__reserved as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_add_key_arg),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fscrypt_add_key_arg>())).raw as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_add_key_arg),
            "::",
            stringify!(raw)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_fscrypt_remove_key_arg {
    pub key_spec: lkl_fscrypt_key_specifier,
    pub removal_status_flags: __lkl__u32,
    pub __reserved: [__lkl__u32; 5usize],
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_remove_key_arg() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_remove_key_arg>(),
        64usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_remove_key_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_remove_key_arg>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_remove_key_arg))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_remove_key_arg>())).key_spec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_remove_key_arg),
            "::",
            stringify!(key_spec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_remove_key_arg>())).removal_status_flags as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_remove_key_arg),
            "::",
            stringify!(removal_status_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_remove_key_arg>())).__reserved as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_remove_key_arg),
            "::",
            stringify!(__reserved)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_fscrypt_get_key_status_arg {
    pub key_spec: lkl_fscrypt_key_specifier,
    pub __reserved: [__lkl__u32; 6usize],
    pub status: __lkl__u32,
    pub status_flags: __lkl__u32,
    pub user_count: __lkl__u32,
    pub __out_reserved: [__lkl__u32; 13usize],
}
#[test]
fn bindgen_test_layout_lkl_fscrypt_get_key_status_arg() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fscrypt_get_key_status_arg>(),
        128usize,
        concat!("Size of: ", stringify!(lkl_fscrypt_get_key_status_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fscrypt_get_key_status_arg>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fscrypt_get_key_status_arg))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).key_spec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(key_spec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).__reserved as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(__reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).status as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).status_flags as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(status_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).user_count as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(user_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_fscrypt_get_key_status_arg>())).__out_reserved as *const _
                as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fscrypt_get_key_status_arg),
            "::",
            stringify!(__out_reserved)
        )
    );
}
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_FLAG: lkl_fsconfig_command = 0;
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_STRING: lkl_fsconfig_command = 1;
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_BINARY: lkl_fsconfig_command = 2;
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_PATH: lkl_fsconfig_command = 3;
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_PATH_EMPTY: lkl_fsconfig_command = 4;
pub const lkl_fsconfig_command_LKL_FSCONFIG_SET_FD: lkl_fsconfig_command = 5;
pub const lkl_fsconfig_command_LKL_FSCONFIG_CMD_CREATE: lkl_fsconfig_command = 6;
pub const lkl_fsconfig_command_LKL_FSCONFIG_CMD_RECONFIGURE: lkl_fsconfig_command = 7;
pub type lkl_fsconfig_command = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_file_clone_range {
    pub src_fd: __lkl__s64,
    pub src_offset: __lkl__u64,
    pub src_length: __lkl__u64,
    pub dest_offset: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_file_clone_range() {
    assert_eq!(
        ::std::mem::size_of::<lkl_file_clone_range>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_file_clone_range))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_file_clone_range>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_file_clone_range))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_clone_range>())).src_fd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_clone_range),
            "::",
            stringify!(src_fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_clone_range>())).src_offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_clone_range),
            "::",
            stringify!(src_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_clone_range>())).src_length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_clone_range),
            "::",
            stringify!(src_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_clone_range>())).dest_offset as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_clone_range),
            "::",
            stringify!(dest_offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_fstrim_range {
    pub start: __lkl__u64,
    pub len: __lkl__u64,
    pub minlen: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_fstrim_range() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fstrim_range>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_fstrim_range))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fstrim_range>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_fstrim_range))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fstrim_range>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fstrim_range),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fstrim_range>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fstrim_range),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fstrim_range>())).minlen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fstrim_range),
            "::",
            stringify!(minlen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_file_dedupe_range_info {
    pub dest_fd: __lkl__s64,
    pub dest_offset: __lkl__u64,
    pub bytes_deduped: __lkl__u64,
    pub status: __lkl__s32,
    pub reserved: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_file_dedupe_range_info() {
    assert_eq!(
        ::std::mem::size_of::<lkl_file_dedupe_range_info>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_file_dedupe_range_info))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_file_dedupe_range_info>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_file_dedupe_range_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range_info>())).dest_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range_info),
            "::",
            stringify!(dest_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range_info>())).dest_offset as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range_info),
            "::",
            stringify!(dest_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range_info>())).bytes_deduped as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range_info),
            "::",
            stringify!(bytes_deduped)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range_info>())).status as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range_info),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range_info>())).reserved as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range_info),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lkl_file_dedupe_range {
    pub src_offset: __lkl__u64,
    pub src_length: __lkl__u64,
    pub dest_count: __lkl__u16,
    pub reserved1: __lkl__u16,
    pub reserved2: __lkl__u32,
    pub info: __IncompleteArrayField<lkl_file_dedupe_range_info>,
}
#[test]
fn bindgen_test_layout_lkl_file_dedupe_range() {
    assert_eq!(
        ::std::mem::size_of::<lkl_file_dedupe_range>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_file_dedupe_range))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_file_dedupe_range>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_file_dedupe_range))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range>())).src_offset as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(src_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range>())).src_length as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(src_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_file_dedupe_range>())).dest_count as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(dest_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_dedupe_range>())).reserved1 as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_dedupe_range>())).reserved2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_file_dedupe_range>())).info as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_file_dedupe_range),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_files_stat_struct {
    pub nr_files: ::std::os::raw::c_ulong,
    pub nr_free_files: ::std::os::raw::c_ulong,
    pub max_files: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_lkl_files_stat_struct() {
    assert_eq!(
        ::std::mem::size_of::<lkl_files_stat_struct>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_files_stat_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_files_stat_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_files_stat_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_files_stat_struct>())).nr_files as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_files_stat_struct),
            "::",
            stringify!(nr_files)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_files_stat_struct>())).nr_free_files as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_files_stat_struct),
            "::",
            stringify!(nr_free_files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_files_stat_struct>())).max_files as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_files_stat_struct),
            "::",
            stringify!(max_files)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_inodes_stat_t {
    pub nr_inodes: ::std::os::raw::c_long,
    pub nr_unused: ::std::os::raw::c_long,
    pub dummy: [::std::os::raw::c_long; 5usize],
}
#[test]
fn bindgen_test_layout_lkl_inodes_stat_t() {
    assert_eq!(
        ::std::mem::size_of::<lkl_inodes_stat_t>(),
        56usize,
        concat!("Size of: ", stringify!(lkl_inodes_stat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_inodes_stat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_inodes_stat_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_inodes_stat_t>())).nr_inodes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_inodes_stat_t),
            "::",
            stringify!(nr_inodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_inodes_stat_t>())).nr_unused as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_inodes_stat_t),
            "::",
            stringify!(nr_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_inodes_stat_t>())).dummy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_inodes_stat_t),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_fsxattr {
    pub fsx_xflags: __lkl__u32,
    pub fsx_extsize: __lkl__u32,
    pub fsx_nextents: __lkl__u32,
    pub fsx_projid: __lkl__u32,
    pub fsx_cowextsize: __lkl__u32,
    pub fsx_pad: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_lkl_fsxattr() {
    assert_eq!(
        ::std::mem::size_of::<lkl_fsxattr>(),
        28usize,
        concat!("Size of: ", stringify!(lkl_fsxattr))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_fsxattr>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_fsxattr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_xflags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_xflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_extsize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_extsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_nextents as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_nextents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_projid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_projid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_cowextsize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_cowextsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_fsxattr>())).fsx_pad as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_fsxattr),
            "::",
            stringify!(fsx_pad)
        )
    );
}
pub type __lkl__kernel_rwf_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_statfs {
    pub f_type: __lkl__kernel_long_t,
    pub f_bsize: __lkl__kernel_long_t,
    pub f_blocks: __lkl__kernel_long_t,
    pub f_bfree: __lkl__kernel_long_t,
    pub f_bavail: __lkl__kernel_long_t,
    pub f_files: __lkl__kernel_long_t,
    pub f_ffree: __lkl__kernel_long_t,
    pub f_fsid: __lkl__kernel_fsid_t,
    pub f_namelen: __lkl__kernel_long_t,
    pub f_frsize: __lkl__kernel_long_t,
    pub f_flags: __lkl__kernel_long_t,
    pub f_spare: [__lkl__kernel_long_t; 4usize],
}
#[test]
fn bindgen_test_layout_lkl_statfs() {
    assert_eq!(
        ::std::mem::size_of::<lkl_statfs>(),
        120usize,
        concat!("Size of: ", stringify!(lkl_statfs))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_statfs>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_statfs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_bsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_bsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_blocks as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_bfree as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_bfree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_bavail as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_bavail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_files as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_ffree as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_ffree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_fsid as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_fsid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_namelen as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_frsize as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_frsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_flags as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs>())).f_spare as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs),
            "::",
            stringify!(f_spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_statfs64 {
    pub f_type: __lkl__kernel_long_t,
    pub f_bsize: __lkl__kernel_long_t,
    pub f_blocks: __lkl__u64,
    pub f_bfree: __lkl__u64,
    pub f_bavail: __lkl__u64,
    pub f_files: __lkl__u64,
    pub f_ffree: __lkl__u64,
    pub f_fsid: __lkl__kernel_fsid_t,
    pub f_namelen: __lkl__kernel_long_t,
    pub f_frsize: __lkl__kernel_long_t,
    pub f_flags: __lkl__kernel_long_t,
    pub f_spare: [__lkl__kernel_long_t; 4usize],
}
#[test]
fn bindgen_test_layout_lkl_statfs64() {
    assert_eq!(
        ::std::mem::size_of::<lkl_statfs64>(),
        120usize,
        concat!("Size of: ", stringify!(lkl_statfs64))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_statfs64>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_statfs64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_bsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_bsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_blocks as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_bfree as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_bfree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_bavail as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_bavail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_files as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_ffree as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_ffree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_fsid as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_fsid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_namelen as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_frsize as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_frsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_flags as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_statfs64>())).f_spare as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_statfs64),
            "::",
            stringify!(f_spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_compat_statfs64 {
    pub f_type: __lkl__u32,
    pub f_bsize: __lkl__u32,
    pub f_blocks: __lkl__u64,
    pub f_bfree: __lkl__u64,
    pub f_bavail: __lkl__u64,
    pub f_files: __lkl__u64,
    pub f_ffree: __lkl__u64,
    pub f_fsid: __lkl__kernel_fsid_t,
    pub f_namelen: __lkl__u32,
    pub f_frsize: __lkl__u32,
    pub f_flags: __lkl__u32,
    pub f_spare: [__lkl__u32; 4usize],
}
#[test]
fn bindgen_test_layout_lkl_compat_statfs64() {
    assert_eq!(
        ::std::mem::size_of::<lkl_compat_statfs64>(),
        88usize,
        concat!("Size of: ", stringify!(lkl_compat_statfs64))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_compat_statfs64>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_compat_statfs64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_bsize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_bsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_blocks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_bfree as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_bfree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_bavail as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_bavail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_files as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_ffree as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_ffree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_fsid as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_fsid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_namelen as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_frsize as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_frsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_flags as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_compat_statfs64>())).f_spare as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_compat_statfs64),
            "::",
            stringify!(f_spare)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_stat {
    pub st_dev: ::std::os::raw::c_ulong,
    pub st_ino: ::std::os::raw::c_ulong,
    pub st_mode: ::std::os::raw::c_uint,
    pub st_nlink: ::std::os::raw::c_uint,
    pub st_uid: ::std::os::raw::c_uint,
    pub st_gid: ::std::os::raw::c_uint,
    pub st_rdev: ::std::os::raw::c_ulong,
    pub __pad1: ::std::os::raw::c_ulong,
    pub st_size: ::std::os::raw::c_long,
    pub st_blksize: ::std::os::raw::c_int,
    pub __pad2: ::std::os::raw::c_int,
    pub st_blocks: ::std::os::raw::c_long,
    pub lkl_st_atime: ::std::os::raw::c_long,
    pub st_atime_nsec: ::std::os::raw::c_ulong,
    pub lkl_st_mtime: ::std::os::raw::c_long,
    pub st_mtime_nsec: ::std::os::raw::c_ulong,
    pub lkl_st_ctime: ::std::os::raw::c_long,
    pub st_ctime_nsec: ::std::os::raw::c_ulong,
    pub __unused4: ::std::os::raw::c_uint,
    pub __unused5: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_lkl_stat() {
    assert_eq!(
        ::std::mem::size_of::<lkl_stat>(),
        128usize,
        concat!("Size of: ", stringify!(lkl_stat))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_stat>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_stat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_ino as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_mode as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_nlink as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_uid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_gid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_rdev as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).__pad1 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_blksize as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).__pad2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_blocks as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).lkl_st_atime as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(lkl_st_atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_atime_nsec as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_atime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).lkl_st_mtime as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(lkl_st_mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_mtime_nsec as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_mtime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).lkl_st_ctime as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(lkl_st_ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).st_ctime_nsec as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(st_ctime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).__unused4 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(__unused4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat>())).__unused5 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat),
            "::",
            stringify!(__unused5)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_stat64 {
    pub st_dev: ::std::os::raw::c_ulonglong,
    pub st_ino: ::std::os::raw::c_ulonglong,
    pub st_mode: ::std::os::raw::c_uint,
    pub st_nlink: ::std::os::raw::c_uint,
    pub st_uid: ::std::os::raw::c_uint,
    pub st_gid: ::std::os::raw::c_uint,
    pub st_rdev: ::std::os::raw::c_ulonglong,
    pub __pad1: ::std::os::raw::c_ulonglong,
    pub st_size: ::std::os::raw::c_longlong,
    pub st_blksize: ::std::os::raw::c_int,
    pub __pad2: ::std::os::raw::c_int,
    pub st_blocks: ::std::os::raw::c_longlong,
    pub lkl_st_atime: ::std::os::raw::c_int,
    pub st_atime_nsec: ::std::os::raw::c_uint,
    pub lkl_st_mtime: ::std::os::raw::c_int,
    pub st_mtime_nsec: ::std::os::raw::c_uint,
    pub lkl_st_ctime: ::std::os::raw::c_int,
    pub st_ctime_nsec: ::std::os::raw::c_uint,
    pub __unused4: ::std::os::raw::c_uint,
    pub __unused5: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_lkl_stat64() {
    assert_eq!(
        ::std::mem::size_of::<lkl_stat64>(),
        104usize,
        concat!("Size of: ", stringify!(lkl_stat64))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_stat64>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_stat64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_ino as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_mode as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_nlink as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_uid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_gid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_rdev as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).__pad1 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_blksize as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).__pad2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_blocks as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).lkl_st_atime as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(lkl_st_atime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_atime_nsec as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_atime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).lkl_st_mtime as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(lkl_st_mtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_mtime_nsec as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_mtime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).lkl_st_ctime as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(lkl_st_ctime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).st_ctime_nsec as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(st_ctime_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).__unused4 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(__unused4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_stat64>())).__unused5 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_stat64),
            "::",
            stringify!(__unused5)
        )
    );
}
pub const LKL_BPF_REG_0: ::std::os::raw::c_uint = 0;
pub const LKL_BPF_REG_1: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_REG_2: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_REG_3: ::std::os::raw::c_uint = 3;
pub const LKL_BPF_REG_4: ::std::os::raw::c_uint = 4;
pub const LKL_BPF_REG_5: ::std::os::raw::c_uint = 5;
pub const LKL_BPF_REG_6: ::std::os::raw::c_uint = 6;
pub const LKL_BPF_REG_7: ::std::os::raw::c_uint = 7;
pub const LKL_BPF_REG_8: ::std::os::raw::c_uint = 8;
pub const LKL_BPF_REG_9: ::std::os::raw::c_uint = 9;
pub const LKL_BPF_REG_10: ::std::os::raw::c_uint = 10;
pub const __LKL__MAX_BPF_REG: ::std::os::raw::c_uint = 11;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_insn {
    pub code: __lkl__u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub off: __lkl__s16,
    pub imm: __lkl__s32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_insn() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_insn>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_bpf_insn))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_insn>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_insn))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_insn>())).code as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_insn),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_insn>())).off as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_insn),
            "::",
            stringify!(off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_insn>())).imm as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_insn),
            "::",
            stringify!(imm)
        )
    );
}
impl lkl_bpf_insn {
    #[inline]
    pub fn dst_reg(&self) -> __lkl__u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_dst_reg(&mut self, val: __lkl__u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn src_reg(&self) -> __lkl__u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_src_reg(&mut self, val: __lkl__u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        dst_reg: __lkl__u8,
        src_reg: __lkl__u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let dst_reg: u8 = unsafe { ::std::mem::transmute(dst_reg) };
            dst_reg as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let src_reg: u8 = unsafe { ::std::mem::transmute(src_reg) };
            src_reg as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct lkl_bpf_lpm_trie_key {
    pub prefixlen: __lkl__u32,
    pub data: __IncompleteArrayField<__lkl__u8>,
}
#[test]
fn bindgen_test_layout_lkl_bpf_lpm_trie_key() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_lpm_trie_key>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_lpm_trie_key))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_lpm_trie_key>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_lpm_trie_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_lpm_trie_key>())).prefixlen as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_lpm_trie_key),
            "::",
            stringify!(prefixlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_lpm_trie_key>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_lpm_trie_key),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_cgroup_storage_key {
    pub cgroup_inode_id: __lkl__u64,
    pub attach_type: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_cgroup_storage_key() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_cgroup_storage_key>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_cgroup_storage_key))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_cgroup_storage_key>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_cgroup_storage_key))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_cgroup_storage_key>())).cgroup_inode_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_cgroup_storage_key),
            "::",
            stringify!(cgroup_inode_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_cgroup_storage_key>())).attach_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_cgroup_storage_key),
            "::",
            stringify!(attach_type)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_iter_link_info {
    pub map: lkl_bpf_iter_link_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_iter_link_info__bindgen_ty_1 {
    pub map_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_iter_link_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_iter_link_info__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_iter_link_info__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_iter_link_info__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_iter_link_info__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_iter_link_info__bindgen_ty_1>())).map_fd as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_iter_link_info__bindgen_ty_1),
            "::",
            stringify!(map_fd)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_iter_link_info() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_iter_link_info>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_iter_link_info))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_iter_link_info>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_iter_link_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_iter_link_info>())).map as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_iter_link_info),
            "::",
            stringify!(map)
        )
    );
}
pub const lkl_bpf_cmd_LKL_BPF_MAP_CREATE: lkl_bpf_cmd = 0;
pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_ELEM: lkl_bpf_cmd = 1;
pub const lkl_bpf_cmd_LKL_BPF_MAP_UPDATE_ELEM: lkl_bpf_cmd = 2;
pub const lkl_bpf_cmd_LKL_BPF_MAP_DELETE_ELEM: lkl_bpf_cmd = 3;
pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_NEXT_KEY: lkl_bpf_cmd = 4;
pub const lkl_bpf_cmd_LKL_BPF_PROG_LOAD: lkl_bpf_cmd = 5;
pub const lkl_bpf_cmd_LKL_BPF_OBJ_PIN: lkl_bpf_cmd = 6;
pub const lkl_bpf_cmd_LKL_BPF_OBJ_GET: lkl_bpf_cmd = 7;
pub const lkl_bpf_cmd_LKL_BPF_PROG_ATTACH: lkl_bpf_cmd = 8;
pub const lkl_bpf_cmd_LKL_BPF_PROG_DETACH: lkl_bpf_cmd = 9;
pub const lkl_bpf_cmd_LKL_BPF_PROG_TEST_RUN: lkl_bpf_cmd = 10;
pub const lkl_bpf_cmd_LKL_BPF_PROG_GET_NEXT_ID: lkl_bpf_cmd = 11;
pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_NEXT_ID: lkl_bpf_cmd = 12;
pub const lkl_bpf_cmd_LKL_BPF_PROG_GET_FD_BY_ID: lkl_bpf_cmd = 13;
pub const lkl_bpf_cmd_LKL_BPF_MAP_GET_FD_BY_ID: lkl_bpf_cmd = 14;
pub const lkl_bpf_cmd_LKL_BPF_OBJ_GET_INFO_BY_FD: lkl_bpf_cmd = 15;
pub const lkl_bpf_cmd_LKL_BPF_PROG_QUERY: lkl_bpf_cmd = 16;
pub const lkl_bpf_cmd_LKL_BPF_RAW_TRACEPOINT_OPEN: lkl_bpf_cmd = 17;
pub const lkl_bpf_cmd_LKL_BPF_BTF_LOAD: lkl_bpf_cmd = 18;
pub const lkl_bpf_cmd_LKL_BPF_BTF_GET_FD_BY_ID: lkl_bpf_cmd = 19;
pub const lkl_bpf_cmd_LKL_BPF_TASK_FD_QUERY: lkl_bpf_cmd = 20;
pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_AND_DELETE_ELEM: lkl_bpf_cmd = 21;
pub const lkl_bpf_cmd_LKL_BPF_MAP_FREEZE: lkl_bpf_cmd = 22;
pub const lkl_bpf_cmd_LKL_BPF_BTF_GET_NEXT_ID: lkl_bpf_cmd = 23;
pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_BATCH: lkl_bpf_cmd = 24;
pub const lkl_bpf_cmd_LKL_BPF_MAP_LOOKUP_AND_DELETE_BATCH: lkl_bpf_cmd = 25;
pub const lkl_bpf_cmd_LKL_BPF_MAP_UPDATE_BATCH: lkl_bpf_cmd = 26;
pub const lkl_bpf_cmd_LKL_BPF_MAP_DELETE_BATCH: lkl_bpf_cmd = 27;
pub const lkl_bpf_cmd_LKL_BPF_LINK_CREATE: lkl_bpf_cmd = 28;
pub const lkl_bpf_cmd_LKL_BPF_LINK_UPDATE: lkl_bpf_cmd = 29;
pub const lkl_bpf_cmd_LKL_BPF_LINK_GET_FD_BY_ID: lkl_bpf_cmd = 30;
pub const lkl_bpf_cmd_LKL_BPF_LINK_GET_NEXT_ID: lkl_bpf_cmd = 31;
pub const lkl_bpf_cmd_LKL_BPF_ENABLE_STATS: lkl_bpf_cmd = 32;
pub const lkl_bpf_cmd_LKL_BPF_ITER_CREATE: lkl_bpf_cmd = 33;
pub const lkl_bpf_cmd_LKL_BPF_LINK_DETACH: lkl_bpf_cmd = 34;
pub const lkl_bpf_cmd_LKL_BPF_PROG_BIND_MAP: lkl_bpf_cmd = 35;
pub type lkl_bpf_cmd = ::std::os::raw::c_uint;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_UNSPEC: lkl_bpf_map_type = 0;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_HASH: lkl_bpf_map_type = 1;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_ARRAY: lkl_bpf_map_type = 2;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PROG_ARRAY: lkl_bpf_map_type = 3;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERF_EVENT_ARRAY: lkl_bpf_map_type = 4;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_HASH: lkl_bpf_map_type = 5;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_ARRAY: lkl_bpf_map_type = 6;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STACK_TRACE: lkl_bpf_map_type = 7;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CGROUP_ARRAY: lkl_bpf_map_type = 8;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LRU_HASH: lkl_bpf_map_type = 9;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LRU_PERCPU_HASH: lkl_bpf_map_type = 10;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_LPM_TRIE: lkl_bpf_map_type = 11;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_ARRAY_OF_MAPS: lkl_bpf_map_type = 12;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_HASH_OF_MAPS: lkl_bpf_map_type = 13;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_DEVMAP: lkl_bpf_map_type = 14;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SOCKMAP: lkl_bpf_map_type = 15;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CPUMAP: lkl_bpf_map_type = 16;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_XSKMAP: lkl_bpf_map_type = 17;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SOCKHASH: lkl_bpf_map_type = 18;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_CGROUP_STORAGE: lkl_bpf_map_type = 19;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_REUSEPORT_SOCKARRAY: lkl_bpf_map_type = 20;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_PERCPU_CGROUP_STORAGE: lkl_bpf_map_type = 21;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_QUEUE: lkl_bpf_map_type = 22;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STACK: lkl_bpf_map_type = 23;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_SK_STORAGE: lkl_bpf_map_type = 24;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_DEVMAP_HASH: lkl_bpf_map_type = 25;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_STRUCT_OPS: lkl_bpf_map_type = 26;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_RINGBUF: lkl_bpf_map_type = 27;
pub const lkl_bpf_map_type_LKL_BPF_MAP_TYPE_INODE_STORAGE: lkl_bpf_map_type = 28;
pub type lkl_bpf_map_type = ::std::os::raw::c_uint;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_UNSPEC: lkl_bpf_prog_type = 0;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SOCKET_FILTER: lkl_bpf_prog_type = 1;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_KPROBE: lkl_bpf_prog_type = 2;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SCHED_CLS: lkl_bpf_prog_type = 3;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SCHED_ACT: lkl_bpf_prog_type = 4;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_TRACEPOINT: lkl_bpf_prog_type = 5;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_XDP: lkl_bpf_prog_type = 6;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_PERF_EVENT: lkl_bpf_prog_type = 7;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SKB: lkl_bpf_prog_type = 8;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCK: lkl_bpf_prog_type = 9;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_IN: lkl_bpf_prog_type = 10;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_OUT: lkl_bpf_prog_type = 11;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_XMIT: lkl_bpf_prog_type = 12;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SOCK_OPS: lkl_bpf_prog_type = 13;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_SKB: lkl_bpf_prog_type = 14;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_DEVICE: lkl_bpf_prog_type = 15;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_MSG: lkl_bpf_prog_type = 16;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_RAW_TRACEPOINT: lkl_bpf_prog_type = 17;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCK_ADDR: lkl_bpf_prog_type = 18;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LWT_SEG6LOCAL: lkl_bpf_prog_type = 19;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LIRC_MODE2: lkl_bpf_prog_type = 20;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_REUSEPORT: lkl_bpf_prog_type = 21;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_FLOW_DISSECTOR: lkl_bpf_prog_type = 22;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SYSCTL: lkl_bpf_prog_type = 23;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_RAW_TRACEPOINT_WRITABLE: lkl_bpf_prog_type = 24;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_CGROUP_SOCKOPT: lkl_bpf_prog_type = 25;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_TRACING: lkl_bpf_prog_type = 26;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_STRUCT_OPS: lkl_bpf_prog_type = 27;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_EXT: lkl_bpf_prog_type = 28;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_LSM: lkl_bpf_prog_type = 29;
pub const lkl_bpf_prog_type_LKL_BPF_PROG_TYPE_SK_LOOKUP: lkl_bpf_prog_type = 30;
pub type lkl_bpf_prog_type = ::std::os::raw::c_uint;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_INGRESS: lkl_bpf_attach_type = 0;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_EGRESS: lkl_bpf_attach_type = 1;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_SOCK_CREATE: lkl_bpf_attach_type = 2;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SOCK_OPS: lkl_bpf_attach_type = 3;
pub const lkl_bpf_attach_type_LKL_BPF_SK_SKB_STREAM_PARSER: lkl_bpf_attach_type = 4;
pub const lkl_bpf_attach_type_LKL_BPF_SK_SKB_STREAM_VERDICT: lkl_bpf_attach_type = 5;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_DEVICE: lkl_bpf_attach_type = 6;
pub const lkl_bpf_attach_type_LKL_BPF_SK_MSG_VERDICT: lkl_bpf_attach_type = 7;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_BIND: lkl_bpf_attach_type = 8;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_BIND: lkl_bpf_attach_type = 9;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_CONNECT: lkl_bpf_attach_type = 10;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_CONNECT: lkl_bpf_attach_type = 11;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_POST_BIND: lkl_bpf_attach_type = 12;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_POST_BIND: lkl_bpf_attach_type = 13;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP4_SENDMSG: lkl_bpf_attach_type = 14;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP6_SENDMSG: lkl_bpf_attach_type = 15;
pub const lkl_bpf_attach_type_LKL_BPF_LIRC_MODE2: lkl_bpf_attach_type = 16;
pub const lkl_bpf_attach_type_LKL_BPF_FLOW_DISSECTOR: lkl_bpf_attach_type = 17;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SYSCTL: lkl_bpf_attach_type = 18;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP4_RECVMSG: lkl_bpf_attach_type = 19;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_UDP6_RECVMSG: lkl_bpf_attach_type = 20;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_GETSOCKOPT: lkl_bpf_attach_type = 21;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_SETSOCKOPT: lkl_bpf_attach_type = 22;
pub const lkl_bpf_attach_type_LKL_BPF_TRACE_RAW_TP: lkl_bpf_attach_type = 23;
pub const lkl_bpf_attach_type_LKL_BPF_TRACE_FENTRY: lkl_bpf_attach_type = 24;
pub const lkl_bpf_attach_type_LKL_BPF_TRACE_FEXIT: lkl_bpf_attach_type = 25;
pub const lkl_bpf_attach_type_LKL_BPF_MODIFY_RETURN: lkl_bpf_attach_type = 26;
pub const lkl_bpf_attach_type_LKL_BPF_LSM_MAC: lkl_bpf_attach_type = 27;
pub const lkl_bpf_attach_type_LKL_BPF_TRACE_ITER: lkl_bpf_attach_type = 28;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_GETPEERNAME: lkl_bpf_attach_type = 29;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_GETPEERNAME: lkl_bpf_attach_type = 30;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET4_GETSOCKNAME: lkl_bpf_attach_type = 31;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET6_GETSOCKNAME: lkl_bpf_attach_type = 32;
pub const lkl_bpf_attach_type_LKL_BPF_XDP_DEVMAP: lkl_bpf_attach_type = 33;
pub const lkl_bpf_attach_type_LKL_BPF_CGROUP_INET_SOCK_RELEASE: lkl_bpf_attach_type = 34;
pub const lkl_bpf_attach_type_LKL_BPF_XDP_CPUMAP: lkl_bpf_attach_type = 35;
pub const lkl_bpf_attach_type_LKL_BPF_SK_LOOKUP: lkl_bpf_attach_type = 36;
pub const lkl_bpf_attach_type_LKL_BPF_XDP: lkl_bpf_attach_type = 37;
pub const lkl_bpf_attach_type___LKL__MAX_BPF_ATTACH_TYPE: lkl_bpf_attach_type = 38;
pub type lkl_bpf_attach_type = ::std::os::raw::c_uint;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_UNSPEC: lkl_bpf_link_type = 0;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_RAW_TRACEPOINT: lkl_bpf_link_type = 1;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_TRACING: lkl_bpf_link_type = 2;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_CGROUP: lkl_bpf_link_type = 3;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_ITER: lkl_bpf_link_type = 4;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_NETNS: lkl_bpf_link_type = 5;
pub const lkl_bpf_link_type_LKL_BPF_LINK_TYPE_XDP: lkl_bpf_link_type = 6;
pub const lkl_bpf_link_type_LKL_MAX_BPF_LINK_TYPE: lkl_bpf_link_type = 7;
pub type lkl_bpf_link_type = ::std::os::raw::c_uint;
pub const LKL_BPF_ANY: ::std::os::raw::c_uint = 0;
pub const LKL_BPF_NOEXIST: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_EXIST: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_F_LOCK: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_NO_PREALLOC: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_F_NO_COMMON_LRU: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_F_NUMA_NODE: ::std::os::raw::c_uint = 4;
pub const LKL_BPF_F_RDONLY: ::std::os::raw::c_uint = 8;
pub const LKL_BPF_F_WRONLY: ::std::os::raw::c_uint = 16;
pub const LKL_BPF_F_STACK_BUILD_ID: ::std::os::raw::c_uint = 32;
pub const LKL_BPF_F_ZERO_SEED: ::std::os::raw::c_uint = 64;
pub const LKL_BPF_F_RDONLY_PROG: ::std::os::raw::c_uint = 128;
pub const LKL_BPF_F_WRONLY_PROG: ::std::os::raw::c_uint = 256;
pub const LKL_BPF_F_CLONE: ::std::os::raw::c_uint = 512;
pub const LKL_BPF_F_MMAPABLE: ::std::os::raw::c_uint = 1024;
pub const LKL_BPF_F_PRESERVE_ELEMS: ::std::os::raw::c_uint = 2048;
pub const LKL_BPF_F_INNER_MAP: ::std::os::raw::c_uint = 4096;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const lkl_bpf_stats_type_LKL_BPF_STATS_RUN_TIME: lkl_bpf_stats_type = 0;
pub type lkl_bpf_stats_type = ::std::os::raw::c_uint;
pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_EMPTY:
    lkl_bpf_stack_build_id_status = 0;
pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_VALID:
    lkl_bpf_stack_build_id_status = 1;
pub const lkl_bpf_stack_build_id_status_LKL_BPF_STACK_BUILD_ID_IP: lkl_bpf_stack_build_id_status =
    2;
pub type lkl_bpf_stack_build_id_status = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_stack_build_id {
    pub status: __lkl__s32,
    pub build_id: [::std::os::raw::c_uchar; 20usize],
    pub __bindgen_anon_1: lkl_bpf_stack_build_id__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_stack_build_id__bindgen_ty_1 {
    pub offset: __lkl__u64,
    pub ip: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_bpf_stack_build_id__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_stack_build_id__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_stack_build_id__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_stack_build_id__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_stack_build_id__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_stack_build_id__bindgen_ty_1>())).offset as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_stack_build_id__bindgen_ty_1),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_stack_build_id__bindgen_ty_1>())).ip as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_stack_build_id__bindgen_ty_1),
            "::",
            stringify!(ip)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_stack_build_id() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_stack_build_id>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_bpf_stack_build_id))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_stack_build_id>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_stack_build_id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_stack_build_id>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_stack_build_id),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_stack_build_id>())).build_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_stack_build_id),
            "::",
            stringify!(build_id)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_attr {
    pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_1,
    pub __bindgen_anon_2: lkl_bpf_attr__bindgen_ty_2,
    pub batch: lkl_bpf_attr__bindgen_ty_3,
    pub __bindgen_anon_3: lkl_bpf_attr__bindgen_ty_4,
    pub __bindgen_anon_4: lkl_bpf_attr__bindgen_ty_5,
    pub __bindgen_anon_5: lkl_bpf_attr__bindgen_ty_6,
    pub test: lkl_bpf_attr__bindgen_ty_7,
    pub __bindgen_anon_6: lkl_bpf_attr__bindgen_ty_8,
    pub info: lkl_bpf_attr__bindgen_ty_9,
    pub query: lkl_bpf_attr__bindgen_ty_10,
    pub raw_tracepoint: lkl_bpf_attr__bindgen_ty_11,
    pub __bindgen_anon_7: lkl_bpf_attr__bindgen_ty_12,
    pub task_fd_query: lkl_bpf_attr__bindgen_ty_13,
    pub link_create: lkl_bpf_attr__bindgen_ty_14,
    pub link_update: lkl_bpf_attr__bindgen_ty_15,
    pub link_detach: lkl_bpf_attr__bindgen_ty_16,
    pub enable_stats: lkl_bpf_attr__bindgen_ty_17,
    pub iter_create: lkl_bpf_attr__bindgen_ty_18,
    pub prog_bind_map: lkl_bpf_attr__bindgen_ty_19,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_1 {
    pub map_type: __lkl__u32,
    pub key_size: __lkl__u32,
    pub value_size: __lkl__u32,
    pub max_entries: __lkl__u32,
    pub map_flags: __lkl__u32,
    pub inner_map_fd: __lkl__u32,
    pub numa_node: __lkl__u32,
    pub map_name: [::std::os::raw::c_char; 16usize],
    pub map_ifindex: __lkl__u32,
    pub btf_fd: __lkl__u32,
    pub btf_key_type_id: __lkl__u32,
    pub btf_value_type_id: __lkl__u32,
    pub btf_vmlinux_value_type_id: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).map_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(map_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).key_size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(key_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).value_size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(value_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).max_entries as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(max_entries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).map_flags as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(map_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).inner_map_fd as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(inner_map_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).numa_node as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(numa_node)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).map_name as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(map_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).map_ifindex as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(map_ifindex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).btf_fd as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(btf_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).btf_key_type_id as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(btf_key_type_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).btf_value_type_id as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(btf_value_type_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_1>())).btf_vmlinux_value_type_id
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_1),
            "::",
            stringify!(btf_vmlinux_value_type_id)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_2 {
    pub map_fd: __lkl__u32,
    pub key: __lkl__u64,
    pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1,
    pub flags: __lkl__u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1 {
    pub value: __lkl__u64,
    pub next_key: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1>())).next_key
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(next_key)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_2>())).map_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2),
            "::",
            stringify!(map_fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_2>())).key as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_2>())).flags as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_2),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_3 {
    pub in_batch: __lkl__u64,
    pub out_batch: __lkl__u64,
    pub keys: __lkl__u64,
    pub values: __lkl__u64,
    pub count: __lkl__u32,
    pub map_fd: __lkl__u32,
    pub elem_flags: __lkl__u64,
    pub flags: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_3>(),
        56usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).in_batch as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(in_batch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).out_batch as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(out_batch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).keys as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).values as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).count as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).map_fd as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(map_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).elem_flags as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(elem_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_3>())).flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_3),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_4 {
    pub prog_type: __lkl__u32,
    pub insn_cnt: __lkl__u32,
    pub insns: __lkl__u64,
    pub license: __lkl__u64,
    pub log_level: __lkl__u32,
    pub log_size: __lkl__u32,
    pub log_buf: __lkl__u64,
    pub kern_version: __lkl__u32,
    pub prog_flags: __lkl__u32,
    pub prog_name: [::std::os::raw::c_char; 16usize],
    pub prog_ifindex: __lkl__u32,
    pub expected_attach_type: __lkl__u32,
    pub prog_btf_fd: __lkl__u32,
    pub func_info_rec_size: __lkl__u32,
    pub func_info: __lkl__u64,
    pub func_info_cnt: __lkl__u32,
    pub line_info_rec_size: __lkl__u32,
    pub line_info: __lkl__u64,
    pub line_info_cnt: __lkl__u32,
    pub attach_btf_id: __lkl__u32,
    pub attach_prog_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_4>(),
        120usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).prog_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(prog_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).insn_cnt as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(insn_cnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).insns as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(insns)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).license as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(license)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).log_level as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(log_level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).log_size as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(log_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).log_buf as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(log_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).kern_version as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(kern_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).prog_flags as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(prog_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).prog_name as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(prog_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).prog_ifindex as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(prog_ifindex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).expected_attach_type as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(expected_attach_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).prog_btf_fd as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(prog_btf_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).func_info_rec_size as *const _
                as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(func_info_rec_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).func_info as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(func_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).func_info_cnt as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(func_info_cnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).line_info_rec_size as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(line_info_rec_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).line_info as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(line_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).line_info_cnt as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(line_info_cnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).attach_btf_id as *const _
                as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(attach_btf_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_4>())).attach_prog_fd as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_4),
            "::",
            stringify!(attach_prog_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_5 {
    pub pathname: __lkl__u64,
    pub bpf_fd: __lkl__u32,
    pub file_flags: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_5>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_5))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_5>())).pathname as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_5),
            "::",
            stringify!(pathname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_5>())).bpf_fd as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_5),
            "::",
            stringify!(bpf_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_5>())).file_flags as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_5),
            "::",
            stringify!(file_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_6 {
    pub target_fd: __lkl__u32,
    pub attach_bpf_fd: __lkl__u32,
    pub attach_type: __lkl__u32,
    pub attach_flags: __lkl__u32,
    pub replace_bpf_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_6>(),
        20usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_6))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_6>())).target_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_6),
            "::",
            stringify!(target_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_6>())).attach_bpf_fd as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_6),
            "::",
            stringify!(attach_bpf_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_6>())).attach_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_6),
            "::",
            stringify!(attach_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_6>())).attach_flags as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_6),
            "::",
            stringify!(attach_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_6>())).replace_bpf_fd as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_6),
            "::",
            stringify!(replace_bpf_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_7 {
    pub prog_fd: __lkl__u32,
    pub retval: __lkl__u32,
    pub data_size_in: __lkl__u32,
    pub data_size_out: __lkl__u32,
    pub data_in: __lkl__u64,
    pub data_out: __lkl__u64,
    pub repeat: __lkl__u32,
    pub duration: __lkl__u32,
    pub ctx_size_in: __lkl__u32,
    pub ctx_size_out: __lkl__u32,
    pub ctx_in: __lkl__u64,
    pub ctx_out: __lkl__u64,
    pub flags: __lkl__u32,
    pub cpu: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_7>(),
        72usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_7))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).prog_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(prog_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).retval as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(retval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).data_size_in as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(data_size_in)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).data_size_out as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(data_size_out)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).data_in as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(data_in)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).data_out as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(data_out)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).repeat as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(repeat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).duration as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).ctx_size_in as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(ctx_size_in)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).ctx_size_out as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(ctx_size_out)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).ctx_in as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(ctx_in)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).ctx_out as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(ctx_out)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).flags as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_7>())).cpu as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_7),
            "::",
            stringify!(cpu)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_8 {
    pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1,
    pub next_id: __lkl__u32,
    pub open_flags: __lkl__u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1 {
    pub start_id: __lkl__u32,
    pub prog_id: __lkl__u32,
    pub map_id: __lkl__u32,
    pub btf_id: __lkl__u32,
    pub link_id: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>())).start_id
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
            "::",
            stringify!(start_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>())).prog_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
            "::",
            stringify!(prog_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>())).map_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
            "::",
            stringify!(map_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>())).btf_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
            "::",
            stringify!(btf_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1>())).link_id as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8__bindgen_ty_1),
            "::",
            stringify!(link_id)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_8>(),
        12usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_8>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_8))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8>())).next_id as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8),
            "::",
            stringify!(next_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_8>())).open_flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_8),
            "::",
            stringify!(open_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_9 {
    pub bpf_fd: __lkl__u32,
    pub info_len: __lkl__u32,
    pub info: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_9>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_9>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_9))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_9>())).bpf_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_9),
            "::",
            stringify!(bpf_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_9>())).info_len as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_9),
            "::",
            stringify!(info_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_9>())).info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_9),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_10 {
    pub target_fd: __lkl__u32,
    pub attach_type: __lkl__u32,
    pub query_flags: __lkl__u32,
    pub attach_flags: __lkl__u32,
    pub prog_ids: __lkl__u64,
    pub prog_cnt: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_10>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_10>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_10))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).target_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(target_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).attach_type as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(attach_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).query_flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(query_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).attach_flags as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(attach_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).prog_ids as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(prog_ids)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_10>())).prog_cnt as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_10),
            "::",
            stringify!(prog_cnt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_11 {
    pub name: __lkl__u64,
    pub prog_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_11>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_11>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_11))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_11>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_11),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_11>())).prog_fd as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_11),
            "::",
            stringify!(prog_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_12 {
    pub btf: __lkl__u64,
    pub btf_log_buf: __lkl__u64,
    pub btf_size: __lkl__u32,
    pub btf_log_size: __lkl__u32,
    pub btf_log_level: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_12>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_12>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_12))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_12>())).btf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_12),
            "::",
            stringify!(btf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_12>())).btf_log_buf as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_12),
            "::",
            stringify!(btf_log_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_12>())).btf_size as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_12),
            "::",
            stringify!(btf_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_12>())).btf_log_size as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_12),
            "::",
            stringify!(btf_log_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_12>())).btf_log_level as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_12),
            "::",
            stringify!(btf_log_level)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_13 {
    pub pid: __lkl__u32,
    pub fd: __lkl__u32,
    pub flags: __lkl__u32,
    pub buf_len: __lkl__u32,
    pub buf: __lkl__u64,
    pub prog_id: __lkl__u32,
    pub fd_type: __lkl__u32,
    pub probe_offset: __lkl__u64,
    pub probe_addr: __lkl__u64,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_13>(),
        48usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_13>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_13))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).pid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).fd as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).buf_len as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(buf_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).prog_id as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(prog_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).fd_type as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(fd_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).probe_offset as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(probe_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_13>())).probe_addr as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_13),
            "::",
            stringify!(probe_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_14 {
    pub prog_fd: __lkl__u32,
    pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1,
    pub attach_type: __lkl__u32,
    pub flags: __lkl__u32,
    pub __bindgen_anon_2: lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1 {
    pub target_fd: __lkl__u32,
    pub target_ifindex: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1>())).target_fd
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1),
            "::",
            stringify!(target_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1>())).target_ifindex
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_1),
            "::",
            stringify!(target_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2 {
    pub target_btf_id: __lkl__u32,
    pub __bindgen_anon_1: lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1 {
    pub iter_info: __lkl__u64,
    pub iter_info_len: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1>()))
                .iter_info as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(iter_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1>()))
                .iter_info_len as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(iter_info_len)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2>())).target_btf_id
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14__bindgen_ty_2),
            "::",
            stringify!(target_btf_id)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_14>(),
        32usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_14>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_14))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14>())).prog_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14),
            "::",
            stringify!(prog_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14>())).attach_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14),
            "::",
            stringify!(attach_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_14>())).flags as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_14),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_15 {
    pub link_fd: __lkl__u32,
    pub new_prog_fd: __lkl__u32,
    pub flags: __lkl__u32,
    pub old_prog_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_15>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_15>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_15))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_15>())).link_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_15),
            "::",
            stringify!(link_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_15>())).new_prog_fd as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_15),
            "::",
            stringify!(new_prog_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_15>())).flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_15),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_15>())).old_prog_fd as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_15),
            "::",
            stringify!(old_prog_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_16 {
    pub link_fd: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_16>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_16>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_16))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_16>())).link_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_16),
            "::",
            stringify!(link_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_17 {
    pub type_: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_17() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_17>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_17>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_17))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_17>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_17),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_18 {
    pub link_fd: __lkl__u32,
    pub flags: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_18() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_18>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_18>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_18))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_18>())).link_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_18),
            "::",
            stringify!(link_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_18>())).flags as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_18),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_attr__bindgen_ty_19 {
    pub prog_fd: __lkl__u32,
    pub map_fd: __lkl__u32,
    pub flags: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr__bindgen_ty_19() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr__bindgen_ty_19>(),
        12usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr__bindgen_ty_19))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr__bindgen_ty_19>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr__bindgen_ty_19))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_19>())).prog_fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_19),
            "::",
            stringify!(prog_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_19>())).map_fd as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_19),
            "::",
            stringify!(map_fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_attr__bindgen_ty_19>())).flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr__bindgen_ty_19),
            "::",
            stringify!(flags)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_attr() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_attr>(),
        120usize,
        concat!("Size of: ", stringify!(lkl_bpf_attr))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_attr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).batch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(batch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).test as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(test)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).query as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).raw_tracepoint as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(raw_tracepoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).task_fd_query as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(task_fd_query)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).link_create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(link_create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).link_update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(link_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).link_detach as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(link_detach)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).enable_stats as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(enable_stats)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).iter_create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(iter_create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_attr>())).prog_bind_map as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_attr),
            "::",
            stringify!(prog_bind_map)
        )
    );
}
pub const lkl_bpf_func_id_BPF_FUNC_unspec: lkl_bpf_func_id = 0;
pub const lkl_bpf_func_id_BPF_FUNC_map_lookup_elem: lkl_bpf_func_id = 1;
pub const lkl_bpf_func_id_BPF_FUNC_map_update_elem: lkl_bpf_func_id = 2;
pub const lkl_bpf_func_id_BPF_FUNC_map_delete_elem: lkl_bpf_func_id = 3;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read: lkl_bpf_func_id = 4;
pub const lkl_bpf_func_id_BPF_FUNC_ktime_get_ns: lkl_bpf_func_id = 5;
pub const lkl_bpf_func_id_BPF_FUNC_trace_printk: lkl_bpf_func_id = 6;
pub const lkl_bpf_func_id_BPF_FUNC_get_prandom_u32: lkl_bpf_func_id = 7;
pub const lkl_bpf_func_id_BPF_FUNC_get_smp_processor_id: lkl_bpf_func_id = 8;
pub const lkl_bpf_func_id_BPF_FUNC_skb_store_bytes: lkl_bpf_func_id = 9;
pub const lkl_bpf_func_id_BPF_FUNC_l3_csum_replace: lkl_bpf_func_id = 10;
pub const lkl_bpf_func_id_BPF_FUNC_l4_csum_replace: lkl_bpf_func_id = 11;
pub const lkl_bpf_func_id_BPF_FUNC_tail_call: lkl_bpf_func_id = 12;
pub const lkl_bpf_func_id_BPF_FUNC_clone_redirect: lkl_bpf_func_id = 13;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_pid_tgid: lkl_bpf_func_id = 14;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_uid_gid: lkl_bpf_func_id = 15;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_comm: lkl_bpf_func_id = 16;
pub const lkl_bpf_func_id_BPF_FUNC_get_cgroup_classid: lkl_bpf_func_id = 17;
pub const lkl_bpf_func_id_BPF_FUNC_skb_vlan_push: lkl_bpf_func_id = 18;
pub const lkl_bpf_func_id_BPF_FUNC_skb_vlan_pop: lkl_bpf_func_id = 19;
pub const lkl_bpf_func_id_BPF_FUNC_skb_get_tunnel_key: lkl_bpf_func_id = 20;
pub const lkl_bpf_func_id_BPF_FUNC_skb_set_tunnel_key: lkl_bpf_func_id = 21;
pub const lkl_bpf_func_id_BPF_FUNC_perf_event_read: lkl_bpf_func_id = 22;
pub const lkl_bpf_func_id_BPF_FUNC_redirect: lkl_bpf_func_id = 23;
pub const lkl_bpf_func_id_BPF_FUNC_get_route_realm: lkl_bpf_func_id = 24;
pub const lkl_bpf_func_id_BPF_FUNC_perf_event_output: lkl_bpf_func_id = 25;
pub const lkl_bpf_func_id_BPF_FUNC_skb_load_bytes: lkl_bpf_func_id = 26;
pub const lkl_bpf_func_id_BPF_FUNC_get_stackid: lkl_bpf_func_id = 27;
pub const lkl_bpf_func_id_BPF_FUNC_csum_diff: lkl_bpf_func_id = 28;
pub const lkl_bpf_func_id_BPF_FUNC_skb_get_tunnel_opt: lkl_bpf_func_id = 29;
pub const lkl_bpf_func_id_BPF_FUNC_skb_set_tunnel_opt: lkl_bpf_func_id = 30;
pub const lkl_bpf_func_id_BPF_FUNC_skb_change_proto: lkl_bpf_func_id = 31;
pub const lkl_bpf_func_id_BPF_FUNC_skb_change_type: lkl_bpf_func_id = 32;
pub const lkl_bpf_func_id_BPF_FUNC_skb_under_cgroup: lkl_bpf_func_id = 33;
pub const lkl_bpf_func_id_BPF_FUNC_get_hash_recalc: lkl_bpf_func_id = 34;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_task: lkl_bpf_func_id = 35;
pub const lkl_bpf_func_id_BPF_FUNC_probe_write_user: lkl_bpf_func_id = 36;
pub const lkl_bpf_func_id_BPF_FUNC_current_task_under_cgroup: lkl_bpf_func_id = 37;
pub const lkl_bpf_func_id_BPF_FUNC_skb_change_tail: lkl_bpf_func_id = 38;
pub const lkl_bpf_func_id_BPF_FUNC_skb_pull_data: lkl_bpf_func_id = 39;
pub const lkl_bpf_func_id_BPF_FUNC_csum_update: lkl_bpf_func_id = 40;
pub const lkl_bpf_func_id_BPF_FUNC_set_hash_invalid: lkl_bpf_func_id = 41;
pub const lkl_bpf_func_id_BPF_FUNC_get_numa_node_id: lkl_bpf_func_id = 42;
pub const lkl_bpf_func_id_BPF_FUNC_skb_change_head: lkl_bpf_func_id = 43;
pub const lkl_bpf_func_id_BPF_FUNC_xdp_adjust_head: lkl_bpf_func_id = 44;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read_str: lkl_bpf_func_id = 45;
pub const lkl_bpf_func_id_BPF_FUNC_get_socket_cookie: lkl_bpf_func_id = 46;
pub const lkl_bpf_func_id_BPF_FUNC_get_socket_uid: lkl_bpf_func_id = 47;
pub const lkl_bpf_func_id_BPF_FUNC_set_hash: lkl_bpf_func_id = 48;
pub const lkl_bpf_func_id_BPF_FUNC_setsockopt: lkl_bpf_func_id = 49;
pub const lkl_bpf_func_id_BPF_FUNC_skb_adjust_room: lkl_bpf_func_id = 50;
pub const lkl_bpf_func_id_BPF_FUNC_redirect_map: lkl_bpf_func_id = 51;
pub const lkl_bpf_func_id_BPF_FUNC_sk_redirect_map: lkl_bpf_func_id = 52;
pub const lkl_bpf_func_id_BPF_FUNC_sock_map_update: lkl_bpf_func_id = 53;
pub const lkl_bpf_func_id_BPF_FUNC_xdp_adjust_meta: lkl_bpf_func_id = 54;
pub const lkl_bpf_func_id_BPF_FUNC_perf_event_read_value: lkl_bpf_func_id = 55;
pub const lkl_bpf_func_id_BPF_FUNC_perf_prog_read_value: lkl_bpf_func_id = 56;
pub const lkl_bpf_func_id_BPF_FUNC_getsockopt: lkl_bpf_func_id = 57;
pub const lkl_bpf_func_id_BPF_FUNC_override_return: lkl_bpf_func_id = 58;
pub const lkl_bpf_func_id_BPF_FUNC_sock_ops_cb_flags_set: lkl_bpf_func_id = 59;
pub const lkl_bpf_func_id_BPF_FUNC_msg_redirect_map: lkl_bpf_func_id = 60;
pub const lkl_bpf_func_id_BPF_FUNC_msg_apply_bytes: lkl_bpf_func_id = 61;
pub const lkl_bpf_func_id_BPF_FUNC_msg_cork_bytes: lkl_bpf_func_id = 62;
pub const lkl_bpf_func_id_BPF_FUNC_msg_pull_data: lkl_bpf_func_id = 63;
pub const lkl_bpf_func_id_BPF_FUNC_bind: lkl_bpf_func_id = 64;
pub const lkl_bpf_func_id_BPF_FUNC_xdp_adjust_tail: lkl_bpf_func_id = 65;
pub const lkl_bpf_func_id_BPF_FUNC_skb_get_xfrm_state: lkl_bpf_func_id = 66;
pub const lkl_bpf_func_id_BPF_FUNC_get_stack: lkl_bpf_func_id = 67;
pub const lkl_bpf_func_id_BPF_FUNC_skb_load_bytes_relative: lkl_bpf_func_id = 68;
pub const lkl_bpf_func_id_BPF_FUNC_fib_lookup: lkl_bpf_func_id = 69;
pub const lkl_bpf_func_id_BPF_FUNC_sock_hash_update: lkl_bpf_func_id = 70;
pub const lkl_bpf_func_id_BPF_FUNC_msg_redirect_hash: lkl_bpf_func_id = 71;
pub const lkl_bpf_func_id_BPF_FUNC_sk_redirect_hash: lkl_bpf_func_id = 72;
pub const lkl_bpf_func_id_BPF_FUNC_lwt_push_encap: lkl_bpf_func_id = 73;
pub const lkl_bpf_func_id_BPF_FUNC_lwt_seg6_store_bytes: lkl_bpf_func_id = 74;
pub const lkl_bpf_func_id_BPF_FUNC_lwt_seg6_adjust_srh: lkl_bpf_func_id = 75;
pub const lkl_bpf_func_id_BPF_FUNC_lwt_seg6_action: lkl_bpf_func_id = 76;
pub const lkl_bpf_func_id_BPF_FUNC_rc_repeat: lkl_bpf_func_id = 77;
pub const lkl_bpf_func_id_BPF_FUNC_rc_keydown: lkl_bpf_func_id = 78;
pub const lkl_bpf_func_id_BPF_FUNC_skb_cgroup_id: lkl_bpf_func_id = 79;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_cgroup_id: lkl_bpf_func_id = 80;
pub const lkl_bpf_func_id_BPF_FUNC_get_local_storage: lkl_bpf_func_id = 81;
pub const lkl_bpf_func_id_BPF_FUNC_sk_select_reuseport: lkl_bpf_func_id = 82;
pub const lkl_bpf_func_id_BPF_FUNC_skb_ancestor_cgroup_id: lkl_bpf_func_id = 83;
pub const lkl_bpf_func_id_BPF_FUNC_sk_lookup_tcp: lkl_bpf_func_id = 84;
pub const lkl_bpf_func_id_BPF_FUNC_sk_lookup_udp: lkl_bpf_func_id = 85;
pub const lkl_bpf_func_id_BPF_FUNC_sk_release: lkl_bpf_func_id = 86;
pub const lkl_bpf_func_id_BPF_FUNC_map_push_elem: lkl_bpf_func_id = 87;
pub const lkl_bpf_func_id_BPF_FUNC_map_pop_elem: lkl_bpf_func_id = 88;
pub const lkl_bpf_func_id_BPF_FUNC_map_peek_elem: lkl_bpf_func_id = 89;
pub const lkl_bpf_func_id_BPF_FUNC_msg_push_data: lkl_bpf_func_id = 90;
pub const lkl_bpf_func_id_BPF_FUNC_msg_pop_data: lkl_bpf_func_id = 91;
pub const lkl_bpf_func_id_BPF_FUNC_rc_pointer_rel: lkl_bpf_func_id = 92;
pub const lkl_bpf_func_id_BPF_FUNC_spin_lock: lkl_bpf_func_id = 93;
pub const lkl_bpf_func_id_BPF_FUNC_spin_unlock: lkl_bpf_func_id = 94;
pub const lkl_bpf_func_id_BPF_FUNC_sk_fullsock: lkl_bpf_func_id = 95;
pub const lkl_bpf_func_id_BPF_FUNC_tcp_sock: lkl_bpf_func_id = 96;
pub const lkl_bpf_func_id_BPF_FUNC_skb_ecn_set_ce: lkl_bpf_func_id = 97;
pub const lkl_bpf_func_id_BPF_FUNC_get_listener_sock: lkl_bpf_func_id = 98;
pub const lkl_bpf_func_id_BPF_FUNC_skc_lookup_tcp: lkl_bpf_func_id = 99;
pub const lkl_bpf_func_id_BPF_FUNC_tcp_check_syncookie: lkl_bpf_func_id = 100;
pub const lkl_bpf_func_id_BPF_FUNC_sysctl_get_name: lkl_bpf_func_id = 101;
pub const lkl_bpf_func_id_BPF_FUNC_sysctl_get_current_value: lkl_bpf_func_id = 102;
pub const lkl_bpf_func_id_BPF_FUNC_sysctl_get_new_value: lkl_bpf_func_id = 103;
pub const lkl_bpf_func_id_BPF_FUNC_sysctl_set_new_value: lkl_bpf_func_id = 104;
pub const lkl_bpf_func_id_BPF_FUNC_strtol: lkl_bpf_func_id = 105;
pub const lkl_bpf_func_id_BPF_FUNC_strtoul: lkl_bpf_func_id = 106;
pub const lkl_bpf_func_id_BPF_FUNC_sk_storage_get: lkl_bpf_func_id = 107;
pub const lkl_bpf_func_id_BPF_FUNC_sk_storage_delete: lkl_bpf_func_id = 108;
pub const lkl_bpf_func_id_BPF_FUNC_send_signal: lkl_bpf_func_id = 109;
pub const lkl_bpf_func_id_BPF_FUNC_tcp_gen_syncookie: lkl_bpf_func_id = 110;
pub const lkl_bpf_func_id_BPF_FUNC_skb_output: lkl_bpf_func_id = 111;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read_user: lkl_bpf_func_id = 112;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read_kernel: lkl_bpf_func_id = 113;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read_user_str: lkl_bpf_func_id = 114;
pub const lkl_bpf_func_id_BPF_FUNC_probe_read_kernel_str: lkl_bpf_func_id = 115;
pub const lkl_bpf_func_id_BPF_FUNC_tcp_send_ack: lkl_bpf_func_id = 116;
pub const lkl_bpf_func_id_BPF_FUNC_send_signal_thread: lkl_bpf_func_id = 117;
pub const lkl_bpf_func_id_BPF_FUNC_jiffies64: lkl_bpf_func_id = 118;
pub const lkl_bpf_func_id_BPF_FUNC_read_branch_records: lkl_bpf_func_id = 119;
pub const lkl_bpf_func_id_BPF_FUNC_get_ns_current_pid_tgid: lkl_bpf_func_id = 120;
pub const lkl_bpf_func_id_BPF_FUNC_xdp_output: lkl_bpf_func_id = 121;
pub const lkl_bpf_func_id_BPF_FUNC_get_netns_cookie: lkl_bpf_func_id = 122;
pub const lkl_bpf_func_id_BPF_FUNC_get_current_ancestor_cgroup_id: lkl_bpf_func_id = 123;
pub const lkl_bpf_func_id_BPF_FUNC_sk_assign: lkl_bpf_func_id = 124;
pub const lkl_bpf_func_id_BPF_FUNC_ktime_get_boot_ns: lkl_bpf_func_id = 125;
pub const lkl_bpf_func_id_BPF_FUNC_seq_printf: lkl_bpf_func_id = 126;
pub const lkl_bpf_func_id_BPF_FUNC_seq_write: lkl_bpf_func_id = 127;
pub const lkl_bpf_func_id_BPF_FUNC_sk_cgroup_id: lkl_bpf_func_id = 128;
pub const lkl_bpf_func_id_BPF_FUNC_sk_ancestor_cgroup_id: lkl_bpf_func_id = 129;
pub const lkl_bpf_func_id_BPF_FUNC_ringbuf_output: lkl_bpf_func_id = 130;
pub const lkl_bpf_func_id_BPF_FUNC_ringbuf_reserve: lkl_bpf_func_id = 131;
pub const lkl_bpf_func_id_BPF_FUNC_ringbuf_submit: lkl_bpf_func_id = 132;
pub const lkl_bpf_func_id_BPF_FUNC_ringbuf_discard: lkl_bpf_func_id = 133;
pub const lkl_bpf_func_id_BPF_FUNC_ringbuf_query: lkl_bpf_func_id = 134;
pub const lkl_bpf_func_id_BPF_FUNC_csum_level: lkl_bpf_func_id = 135;
pub const lkl_bpf_func_id_BPF_FUNC_skc_to_tcp6_sock: lkl_bpf_func_id = 136;
pub const lkl_bpf_func_id_BPF_FUNC_skc_to_tcp_sock: lkl_bpf_func_id = 137;
pub const lkl_bpf_func_id_BPF_FUNC_skc_to_tcp_timewait_sock: lkl_bpf_func_id = 138;
pub const lkl_bpf_func_id_BPF_FUNC_skc_to_tcp_request_sock: lkl_bpf_func_id = 139;
pub const lkl_bpf_func_id_BPF_FUNC_skc_to_udp6_sock: lkl_bpf_func_id = 140;
pub const lkl_bpf_func_id_BPF_FUNC_get_task_stack: lkl_bpf_func_id = 141;
pub const lkl_bpf_func_id_BPF_FUNC_load_hdr_opt: lkl_bpf_func_id = 142;
pub const lkl_bpf_func_id_BPF_FUNC_store_hdr_opt: lkl_bpf_func_id = 143;
pub const lkl_bpf_func_id_BPF_FUNC_reserve_hdr_opt: lkl_bpf_func_id = 144;
pub const lkl_bpf_func_id_BPF_FUNC_inode_storage_get: lkl_bpf_func_id = 145;
pub const lkl_bpf_func_id_BPF_FUNC_inode_storage_delete: lkl_bpf_func_id = 146;
pub const lkl_bpf_func_id_BPF_FUNC_d_path: lkl_bpf_func_id = 147;
pub const lkl_bpf_func_id_BPF_FUNC_copy_from_user: lkl_bpf_func_id = 148;
pub const lkl_bpf_func_id_BPF_FUNC_snprintf_btf: lkl_bpf_func_id = 149;
pub const lkl_bpf_func_id_BPF_FUNC_seq_printf_btf: lkl_bpf_func_id = 150;
pub const lkl_bpf_func_id_BPF_FUNC_skb_cgroup_classid: lkl_bpf_func_id = 151;
pub const lkl_bpf_func_id_BPF_FUNC_redirect_neigh: lkl_bpf_func_id = 152;
pub const lkl_bpf_func_id_BPF_FUNC_per_cpu_ptr: lkl_bpf_func_id = 153;
pub const lkl_bpf_func_id_BPF_FUNC_this_cpu_ptr: lkl_bpf_func_id = 154;
pub const lkl_bpf_func_id_BPF_FUNC_redirect_peer: lkl_bpf_func_id = 155;
pub const lkl_bpf_func_id___LKL__BPF_FUNC_MAX_ID: lkl_bpf_func_id = 156;
pub type lkl_bpf_func_id = ::std::os::raw::c_uint;
pub const LKL_BPF_F_RECOMPUTE_CSUM: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_F_INVALIDATE_HASH: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_HDR_FIELD_MASK: ::std::os::raw::c_uint = 15;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_PSEUDO_HDR: ::std::os::raw::c_uint = 16;
pub const LKL_BPF_F_MARK_MANGLED_0: ::std::os::raw::c_uint = 32;
pub const LKL_BPF_F_MARK_ENFORCE: ::std::os::raw::c_uint = 64;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_INGRESS: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_TUNINFO_IPV6: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_SKIP_FIELD_MASK: ::std::os::raw::c_uint = 255;
pub const LKL_BPF_F_USER_STACK: ::std::os::raw::c_uint = 256;
pub const LKL_BPF_F_FAST_STACK_CMP: ::std::os::raw::c_uint = 512;
pub const LKL_BPF_F_REUSE_STACKID: ::std::os::raw::c_uint = 1024;
pub const LKL_BPF_F_USER_BUILD_ID: ::std::os::raw::c_uint = 2048;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_ZERO_CSUM_TX: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_F_DONT_FRAGMENT: ::std::os::raw::c_uint = 4;
pub const LKL_BPF_F_SEQ_NUMBER: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_INDEX_MASK: ::std::os::raw::c_ulong = 4294967295;
pub const LKL_BPF_F_CURRENT_CPU: ::std::os::raw::c_ulong = 4294967295;
pub const LKL_BPF_F_CTXLEN_MASK: ::std::os::raw::c_ulong = 4503595332403200;
pub type _bindgen_ty_11 = ::std::os::raw::c_ulong;
pub const LKL_BPF_F_CURRENT_NETNS: ::std::os::raw::c_int = -1;
pub type _bindgen_ty_12 = ::std::os::raw::c_int;
pub const LKL_BPF_CSUM_LEVEL_QUERY: ::std::os::raw::c_uint = 0;
pub const LKL_BPF_CSUM_LEVEL_INC: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_CSUM_LEVEL_DEC: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_CSUM_LEVEL_RESET: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_ADJ_ROOM_FIXED_GSO: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_F_ADJ_ROOM_ENCAP_L3_IPV4: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_F_ADJ_ROOM_ENCAP_L3_IPV6: ::std::os::raw::c_uint = 4;
pub const LKL_BPF_F_ADJ_ROOM_ENCAP_L4_GRE: ::std::os::raw::c_uint = 8;
pub const LKL_BPF_F_ADJ_ROOM_ENCAP_L4_UDP: ::std::os::raw::c_uint = 16;
pub const LKL_BPF_F_ADJ_ROOM_NO_CSUM_RESET: ::std::os::raw::c_uint = 32;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
pub const LKL_BPF_ADJ_ROOM_ENCAP_L2_MASK: ::std::os::raw::c_uint = 255;
pub const LKL_BPF_ADJ_ROOM_ENCAP_L2_SHIFT: ::std::os::raw::c_uint = 56;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_SYSCTL_BASE_NAME: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub const LKL_BPF_LOCAL_STORAGE_GET_F_CREATE: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_SK_STORAGE_GET_F_CREATE: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
pub const LKL_BPF_F_GET_BRANCH_RECORDS_SIZE: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
pub const LKL_BPF_RB_NO_WAKEUP: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_RB_FORCE_WAKEUP: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
pub const LKL_BPF_RB_AVAIL_DATA: ::std::os::raw::c_uint = 0;
pub const LKL_BPF_RB_RING_SIZE: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_RB_CONS_POS: ::std::os::raw::c_uint = 2;
pub const LKL_BPF_RB_PROD_POS: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
pub const LKL_BPF_RINGBUF_BUSY_BIT: ::std::os::raw::c_uint = 2147483648;
pub const LKL_BPF_RINGBUF_DISCARD_BIT: ::std::os::raw::c_uint = 1073741824;
pub const LKL_BPF_RINGBUF_HDR_SZ: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_21 = ::std::os::raw::c_uint;
pub const LKL_BPF_SK_LOOKUP_F_REPLACE: ::std::os::raw::c_uint = 1;
pub const LKL_BPF_SK_LOOKUP_F_NO_REUSEPORT: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_22 = ::std::os::raw::c_uint;
pub const lkl_bpf_adj_room_mode_LKL_BPF_ADJ_ROOM_NET: lkl_bpf_adj_room_mode = 0;
pub const lkl_bpf_adj_room_mode_LKL_BPF_ADJ_ROOM_MAC: lkl_bpf_adj_room_mode = 1;
pub type lkl_bpf_adj_room_mode = ::std::os::raw::c_uint;
pub const lkl_bpf_hdr_start_off_LKL_BPF_HDR_START_MAC: lkl_bpf_hdr_start_off = 0;
pub const lkl_bpf_hdr_start_off_LKL_BPF_HDR_START_NET: lkl_bpf_hdr_start_off = 1;
pub type lkl_bpf_hdr_start_off = ::std::os::raw::c_uint;
pub const lkl_bpf_lwt_encap_mode_LKL_BPF_LWT_ENCAP_SEG6: lkl_bpf_lwt_encap_mode = 0;
pub const lkl_bpf_lwt_encap_mode_LKL_BPF_LWT_ENCAP_SEG6_INLINE: lkl_bpf_lwt_encap_mode = 1;
pub const lkl_bpf_lwt_encap_mode_LKL_BPF_LWT_ENCAP_IP: lkl_bpf_lwt_encap_mode = 2;
pub type lkl_bpf_lwt_encap_mode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __lkl__sk_buff {
    pub len: __lkl__u32,
    pub pkt_type: __lkl__u32,
    pub mark: __lkl__u32,
    pub queue_mapping: __lkl__u32,
    pub protocol: __lkl__u32,
    pub vlan_present: __lkl__u32,
    pub vlan_tci: __lkl__u32,
    pub vlan_proto: __lkl__u32,
    pub priority: __lkl__u32,
    pub ingress_ifindex: __lkl__u32,
    pub ifindex: __lkl__u32,
    pub tc_index: __lkl__u32,
    pub cb: [__lkl__u32; 5usize],
    pub hash: __lkl__u32,
    pub tc_classid: __lkl__u32,
    pub data: __lkl__u32,
    pub data_end: __lkl__u32,
    pub napi_id: __lkl__u32,
    pub family: __lkl__u32,
    pub remote_ip4: __lkl__u32,
    pub local_ip4: __lkl__u32,
    pub remote_ip6: [__lkl__u32; 4usize],
    pub local_ip6: [__lkl__u32; 4usize],
    pub remote_port: __lkl__u32,
    pub local_port: __lkl__u32,
    pub data_meta: __lkl__u32,
    pub __bindgen_anon_1: __lkl__sk_buff__bindgen_ty_1,
    pub tstamp: __lkl__u64,
    pub wire_len: __lkl__u32,
    pub gso_segs: __lkl__u32,
    pub __bindgen_anon_2: __lkl__sk_buff__bindgen_ty_2,
    pub gso_size: __lkl__u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __lkl__sk_buff__bindgen_ty_1 {
    pub flow_keys: *mut lkl_bpf_flow_keys,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout___lkl__sk_buff__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__sk_buff__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__lkl__sk_buff__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__sk_buff__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__sk_buff__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__lkl__sk_buff__bindgen_ty_1>())).flow_keys as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff__bindgen_ty_1),
            "::",
            stringify!(flow_keys)
        )
    );
}
impl __lkl__sk_buff__bindgen_ty_1 {
    #[inline]
    pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __lkl__sk_buff__bindgen_ty_2 {
    pub sk: *mut lkl_bpf_sock,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout___lkl__sk_buff__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__sk_buff__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__lkl__sk_buff__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__sk_buff__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__sk_buff__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff__bindgen_ty_2>())).sk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff__bindgen_ty_2),
            "::",
            stringify!(sk)
        )
    );
}
impl __lkl__sk_buff__bindgen_ty_2 {
    #[inline]
    pub fn new_bitfield_1() -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout___lkl__sk_buff() {
    assert_eq!(
        ::std::mem::size_of::<__lkl__sk_buff>(),
        184usize,
        concat!("Size of: ", stringify!(__lkl__sk_buff))
    );
    assert_eq!(
        ::std::mem::align_of::<__lkl__sk_buff>(),
        8usize,
        concat!("Alignment of ", stringify!(__lkl__sk_buff))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).pkt_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(pkt_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).mark as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(mark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).queue_mapping as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(queue_mapping)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).protocol as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(protocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).vlan_present as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(vlan_present)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).vlan_tci as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(vlan_tci)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).vlan_proto as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(vlan_proto)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).priority as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).ingress_ifindex as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(ingress_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).ifindex as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).tc_index as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(tc_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).cb as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).hash as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).tc_classid as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(tc_classid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).data as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).data_end as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(data_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).napi_id as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(napi_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).family as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).remote_ip4 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(remote_ip4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).local_ip4 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(local_ip4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).remote_ip6 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(remote_ip6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).local_ip6 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(local_ip6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).remote_port as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(remote_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).local_port as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(local_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).data_meta as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(data_meta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).tstamp as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(tstamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).wire_len as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(wire_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).gso_segs as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(gso_segs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__lkl__sk_buff>())).gso_size as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(__lkl__sk_buff),
            "::",
            stringify!(gso_size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_tunnel_key {
    pub tunnel_id: __lkl__u32,
    pub __bindgen_anon_1: lkl_bpf_tunnel_key__bindgen_ty_1,
    pub tunnel_tos: __lkl__u8,
    pub tunnel_ttl: __lkl__u8,
    pub tunnel_ext: __lkl__u16,
    pub tunnel_label: __lkl__u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_tunnel_key__bindgen_ty_1 {
    pub remote_ipv4: __lkl__u32,
    pub remote_ipv6: [__lkl__u32; 4usize],
}
#[test]
fn bindgen_test_layout_lkl_bpf_tunnel_key__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_tunnel_key__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_tunnel_key__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_tunnel_key__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_tunnel_key__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_tunnel_key__bindgen_ty_1>())).remote_ipv4 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key__bindgen_ty_1),
            "::",
            stringify!(remote_ipv4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_tunnel_key__bindgen_ty_1>())).remote_ipv6 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key__bindgen_ty_1),
            "::",
            stringify!(remote_ipv6)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_tunnel_key() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_tunnel_key>(),
        28usize,
        concat!("Size of: ", stringify!(lkl_bpf_tunnel_key))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_tunnel_key>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_tunnel_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tunnel_key>())).tunnel_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key),
            "::",
            stringify!(tunnel_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tunnel_key>())).tunnel_tos as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key),
            "::",
            stringify!(tunnel_tos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tunnel_key>())).tunnel_ttl as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key),
            "::",
            stringify!(tunnel_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tunnel_key>())).tunnel_ext as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key),
            "::",
            stringify!(tunnel_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tunnel_key>())).tunnel_label as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tunnel_key),
            "::",
            stringify!(tunnel_label)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_xfrm_state {
    pub reqid: __lkl__u32,
    pub spi: __lkl__u32,
    pub family: __lkl__u16,
    pub ext: __lkl__u16,
    pub __bindgen_anon_1: lkl_bpf_xfrm_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_xfrm_state__bindgen_ty_1 {
    pub remote_ipv4: __lkl__u32,
    pub remote_ipv6: [__lkl__u32; 4usize],
}
#[test]
fn bindgen_test_layout_lkl_bpf_xfrm_state__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_xfrm_state__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(lkl_bpf_xfrm_state__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_xfrm_state__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_xfrm_state__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_xfrm_state__bindgen_ty_1>())).remote_ipv4 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state__bindgen_ty_1),
            "::",
            stringify!(remote_ipv4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_xfrm_state__bindgen_ty_1>())).remote_ipv6 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state__bindgen_ty_1),
            "::",
            stringify!(remote_ipv6)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_xfrm_state() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_xfrm_state>(),
        28usize,
        concat!("Size of: ", stringify!(lkl_bpf_xfrm_state))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_xfrm_state>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_xfrm_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_xfrm_state>())).reqid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state),
            "::",
            stringify!(reqid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_xfrm_state>())).spi as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state),
            "::",
            stringify!(spi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_xfrm_state>())).family as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_xfrm_state>())).ext as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xfrm_state),
            "::",
            stringify!(ext)
        )
    );
}
pub const lkl_bpf_ret_code_LKL_BPF_OK: lkl_bpf_ret_code = 0;
pub const lkl_bpf_ret_code_LKL_BPF_DROP: lkl_bpf_ret_code = 2;
pub const lkl_bpf_ret_code_LKL_BPF_REDIRECT: lkl_bpf_ret_code = 7;
pub const lkl_bpf_ret_code_LKL_BPF_LWT_REROUTE: lkl_bpf_ret_code = 128;
pub type lkl_bpf_ret_code = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_sock {
    pub bound_dev_if: __lkl__u32,
    pub family: __lkl__u32,
    pub type_: __lkl__u32,
    pub protocol: __lkl__u32,
    pub mark: __lkl__u32,
    pub priority: __lkl__u32,
    pub src_ip4: __lkl__u32,
    pub src_ip6: [__lkl__u32; 4usize],
    pub src_port: __lkl__u32,
    pub dst_port: __lkl__u32,
    pub dst_ip4: __lkl__u32,
    pub dst_ip6: [__lkl__u32; 4usize],
    pub state: __lkl__u32,
    pub rx_queue_mapping: __lkl__s32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_sock() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_sock>(),
        80usize,
        concat!("Size of: ", stringify!(lkl_bpf_sock))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_sock>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_sock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).bound_dev_if as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(bound_dev_if)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).family as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).protocol as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(protocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).mark as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(mark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).priority as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).src_ip4 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(src_ip4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).src_ip6 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(src_ip6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).src_port as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(src_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).dst_port as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(dst_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).dst_ip4 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(dst_ip4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).dst_ip6 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(dst_ip6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).state as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_sock>())).rx_queue_mapping as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock),
            "::",
            stringify!(rx_queue_mapping)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_tcp_sock {
    pub snd_cwnd: __lkl__u32,
    pub srtt_us: __lkl__u32,
    pub rtt_min: __lkl__u32,
    pub snd_ssthresh: __lkl__u32,
    pub rcv_nxt: __lkl__u32,
    pub snd_nxt: __lkl__u32,
    pub snd_una: __lkl__u32,
    pub mss_cache: __lkl__u32,
    pub ecn_flags: __lkl__u32,
    pub rate_delivered: __lkl__u32,
    pub rate_interval_us: __lkl__u32,
    pub packets_out: __lkl__u32,
    pub retrans_out: __lkl__u32,
    pub total_retrans: __lkl__u32,
    pub segs_in: __lkl__u32,
    pub data_segs_in: __lkl__u32,
    pub segs_out: __lkl__u32,
    pub data_segs_out: __lkl__u32,
    pub lost_out: __lkl__u32,
    pub sacked_out: __lkl__u32,
    pub bytes_received: __lkl__u64,
    pub bytes_acked: __lkl__u64,
    pub dsack_dups: __lkl__u32,
    pub delivered: __lkl__u32,
    pub delivered_ce: __lkl__u32,
    pub icsk_retransmits: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_tcp_sock() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_tcp_sock>(),
        112usize,
        concat!("Size of: ", stringify!(lkl_bpf_tcp_sock))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_tcp_sock>(),
        8usize,
        concat!("Alignment of ", stringify!(lkl_bpf_tcp_sock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).snd_cwnd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(snd_cwnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).srtt_us as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(srtt_us)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).rtt_min as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(rtt_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).snd_ssthresh as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(snd_ssthresh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).rcv_nxt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(rcv_nxt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).snd_nxt as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(snd_nxt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).snd_una as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(snd_una)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).mss_cache as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(mss_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).ecn_flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(ecn_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).rate_delivered as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(rate_delivered)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).rate_interval_us as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(rate_interval_us)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).packets_out as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(packets_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).retrans_out as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(retrans_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).total_retrans as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(total_retrans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).segs_in as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(segs_in)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).data_segs_in as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(data_segs_in)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).segs_out as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(segs_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).data_segs_out as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(data_segs_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).lost_out as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(lost_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).sacked_out as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(sacked_out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).bytes_received as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(bytes_received)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).bytes_acked as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(bytes_acked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).dsack_dups as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(dsack_dups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).delivered as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(delivered)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).delivered_ce as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(delivered_ce)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_tcp_sock>())).icsk_retransmits as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_tcp_sock),
            "::",
            stringify!(icsk_retransmits)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_sock_tuple {
    pub __bindgen_anon_1: lkl_bpf_sock_tuple__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_sock_tuple__bindgen_ty_1 {
    pub ipv4: lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1,
    pub ipv6: lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1 {
    pub saddr: __lkl__be32,
    pub daddr: __lkl__be32,
    pub sport: __lkl__be16,
    pub dport: __lkl__be16,
}
#[test]
fn bindgen_test_layout_lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>())).saddr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(saddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>())).daddr
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(daddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>())).sport
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(sport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1>())).dport
                as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(dport)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2 {
    pub saddr: [__lkl__be32; 4usize],
    pub daddr: [__lkl__be32; 4usize],
    pub sport: __lkl__be16,
    pub dport: __lkl__be16,
}
#[test]
fn bindgen_test_layout_lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>())).saddr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(saddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>())).daddr
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(daddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>())).sport
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(sport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2>())).dport
                as *const _ as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(dport)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_sock_tuple__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_sock_tuple__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(lkl_bpf_sock_tuple__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_sock_tuple__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1>())).ipv4 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1),
            "::",
            stringify!(ipv4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_sock_tuple__bindgen_ty_1>())).ipv6 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_sock_tuple__bindgen_ty_1),
            "::",
            stringify!(ipv6)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_sock_tuple() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_sock_tuple>(),
        36usize,
        concat!("Size of: ", stringify!(lkl_bpf_sock_tuple))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_sock_tuple>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_sock_tuple))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_bpf_xdp_sock {
    pub queue_id: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_xdp_sock() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_xdp_sock>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_xdp_sock))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_xdp_sock>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_xdp_sock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_xdp_sock>())).queue_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_xdp_sock),
            "::",
            stringify!(queue_id)
        )
    );
}
pub const lkl_xdp_action_LKL_XDP_ABORTED: lkl_xdp_action = 0;
pub const lkl_xdp_action_LKL_XDP_DROP: lkl_xdp_action = 1;
pub const lkl_xdp_action_LKL_XDP_PASS: lkl_xdp_action = 2;
pub const lkl_xdp_action_LKL_XDP_TX: lkl_xdp_action = 3;
pub const lkl_xdp_action_LKL_XDP_REDIRECT: lkl_xdp_action = 4;
pub type lkl_xdp_action = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lkl_xdp_md {
    pub data: __lkl__u32,
    pub data_end: __lkl__u32,
    pub data_meta: __lkl__u32,
    pub ingress_ifindex: __lkl__u32,
    pub rx_queue_index: __lkl__u32,
    pub egress_ifindex: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_xdp_md() {
    assert_eq!(
        ::std::mem::size_of::<lkl_xdp_md>(),
        24usize,
        concat!("Size of: ", stringify!(lkl_xdp_md))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_xdp_md>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_xdp_md))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).data_end as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(data_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).data_meta as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(data_meta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).ingress_ifindex as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(ingress_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).rx_queue_index as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(rx_queue_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_xdp_md>())).egress_ifindex as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_xdp_md),
            "::",
            stringify!(egress_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_devmap_val {
    pub ifindex: __lkl__u32,
    pub bpf_prog: lkl_bpf_devmap_val__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_devmap_val__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub id: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_devmap_val__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_devmap_val__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_devmap_val__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_devmap_val__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_devmap_val__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_devmap_val__bindgen_ty_1>())).fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_devmap_val__bindgen_ty_1),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_devmap_val__bindgen_ty_1>())).id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_devmap_val__bindgen_ty_1),
            "::",
            stringify!(id)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_devmap_val() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_devmap_val>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_bpf_devmap_val))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_devmap_val>(),
        4usize,
        concat!("Alignment of ", stringify!(lkl_bpf_devmap_val))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_devmap_val>())).ifindex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_devmap_val),
            "::",
            stringify!(ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lkl_bpf_devmap_val>())).bpf_prog as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_devmap_val),
            "::",
            stringify!(bpf_prog)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lkl_bpf_cpumap_val {
    pub qsize: __lkl__u32,
    pub bpf_prog: lkl_bpf_cpumap_val__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lkl_bpf_cpumap_val__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub id: __lkl__u32,
}
#[test]
fn bindgen_test_layout_lkl_bpf_cpumap_val__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_cpumap_val__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(lkl_bpf_cpumap_val__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_cpumap_val__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(lkl_bpf_cpumap_val__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_cpumap_val__bindgen_ty_1>())).fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_cpumap_val__bindgen_ty_1),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<lkl_bpf_cpumap_val__bindgen_ty_1>())).id as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lkl_bpf_cpumap_val__bindgen_ty_1),
            "::",
            stringify!(id)
        )
    );
}
#[test]
fn bindgen_test_layout_lkl_bpf_cpumap_val() {
    assert_eq!(
        ::std::mem::size_of::<lkl_bpf_cpumap_val>(),
        8usize,
        concat!("Size of: ", stringify!(lkl_bpf_cpumap_val))
    );
    assert_eq!(
        ::std::mem::align_of::<lkl_bpf_cpumap_val>(),
        4usize,
